; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"

%struct.__uclibc_locale_struct.203 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.202 }
%struct.__collate_t.202 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.570 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.570*, [2 x i32], %struct.__mbstate_t.569, i8* }
%struct.__mbstate_t.569 = type { i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/tmp/klee-uclibc-130")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/tmp/klee-uclibc-130")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/tmp/klee-uclibc-130")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 313, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 312, type: !55, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!54 = !DIFile(filename: "klee_src/runtime/POSIX/fd.c", directory: "/tmp")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "clang version 13.0.1 (https://github.com/llvm/llvm-project.git 75e33f71c2dae584b13a7d1186ae0a038ba98838)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/tmp/klee_src/runtime/POSIX/fd.c", directory: "/tmp/klee_build130stp_z3/runtime/POSIX")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "klee_src/runtime/POSIX/fd.h", directory: "/tmp")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !149, !156, !162, !167, !172}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 345, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 344, type: !143, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !6, !147}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !148, line: 46, baseType: !10)
!148 = !DIFile(filename: "llvm-130-install_O_D_A/lib/clang/13.0.1/include/stddef.h", directory: "/tmp")
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "n_calls", scope: !151, file: !54, line: 411, type: !45, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 410, type: !152, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!145, !45, !154, !147}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "n_calls", scope: !158, file: !54, line: 647, type: !45, isLocal: true, isDefinition: true)
!158 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 646, type: !159, scopeLine: 646, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!159 = !DISubroutineType(types: !160)
!160 = !{!45, !29, !161}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "n_calls", scope: !164, file: !54, line: 666, type: !45, isLocal: true, isDefinition: true)
!164 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 665, type: !165, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!165 = !DISubroutineType(types: !166)
!166 = !{!45, !45, !161}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "n_calls", scope: !169, file: !54, line: 752, type: !45, isLocal: true, isDefinition: true)
!169 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 751, type: !170, scopeLine: 751, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!170 = !DISubroutineType(types: !171)
!171 = !{!45, !45, !82}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "n_calls", scope: !174, file: !54, line: 1346, type: !45, isLocal: true, isDefinition: true)
!174 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1345, type: !175, scopeLine: 1345, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!175 = !DISubroutineType(types: !176)
!176 = !{!7, !7, !147}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !179, file: !214, line: 375, type: !453, isLocal: false, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !181, retainedTypes: !203, globals: !256, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/tmp/klee-uclibc-130")
!181 = !{!182, !188}
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 90, baseType: !62, size: 32, elements: !184)
!183 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/tmp/klee-uclibc-130")
!184 = !{!185, !186, !187}
!185 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!186 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!187 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 48, baseType: !62, size: 32, elements: !190)
!189 = !DIFile(filename: "./include/ctype.h", directory: "/tmp/klee-uclibc-130")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!191 = !DIEnumerator(name: "_ISupper", value: 256)
!192 = !DIEnumerator(name: "_ISlower", value: 512)
!193 = !DIEnumerator(name: "_ISalpha", value: 1024)
!194 = !DIEnumerator(name: "_ISdigit", value: 2048)
!195 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!196 = !DIEnumerator(name: "_ISspace", value: 8192)
!197 = !DIEnumerator(name: "_ISprint", value: 16384)
!198 = !DIEnumerator(name: "_ISgraph", value: 32768)
!199 = !DIEnumerator(name: "_ISblank", value: 1)
!200 = !DIEnumerator(name: "_IScntrl", value: 2)
!201 = !DIEnumerator(name: "_ISpunct", value: 4)
!202 = !DIEnumerator(name: "_ISalnum", value: 8)
!203 = !{!45, !204, !7, !205, !207, !210, !96, !211, !212, !225, !233, !10}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!210 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !214, line: 400, baseType: !215)
!214 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/tmp/klee-uclibc-130")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 390, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !215, file: !214, line: 391, baseType: !209, size: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !215, file: !214, line: 392, baseType: !209, size: 16, offset: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !215, file: !214, line: 393, baseType: !209, size: 16, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !215, file: !214, line: 394, baseType: !209, size: 16, offset: 48)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !215, file: !214, line: 396, baseType: !209, size: 16, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !215, file: !214, line: 397, baseType: !209, size: 16, offset: 80)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !215, file: !214, line: 398, baseType: !209, size: 16, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !215, file: !214, line: 399, baseType: !209, size: 16, offset: 112)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !214, line: 430, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 425, size: 64, elements: !228)
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !227, file: !214, line: 426, baseType: !209, size: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !227, file: !214, line: 427, baseType: !209, size: 16, offset: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !227, file: !214, line: 428, baseType: !209, size: 16, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !227, file: !214, line: 429, baseType: !209, size: 16, offset: 48)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !214, line: 423, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 402, size: 304, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !235, file: !214, line: 403, baseType: !209, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !235, file: !214, line: 404, baseType: !209, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !235, file: !214, line: 405, baseType: !209, size: 16, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !235, file: !214, line: 406, baseType: !209, size: 16, offset: 48)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !235, file: !214, line: 407, baseType: !209, size: 16, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !235, file: !214, line: 408, baseType: !209, size: 16, offset: 80)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !235, file: !214, line: 409, baseType: !209, size: 16, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !235, file: !214, line: 410, baseType: !209, size: 16, offset: 112)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !235, file: !214, line: 411, baseType: !209, size: 16, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !235, file: !214, line: 412, baseType: !209, size: 16, offset: 144)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !235, file: !214, line: 413, baseType: !209, size: 16, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !235, file: !214, line: 414, baseType: !209, size: 16, offset: 176)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !235, file: !214, line: 415, baseType: !209, size: 16, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !235, file: !214, line: 416, baseType: !209, size: 16, offset: 208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !235, file: !214, line: 418, baseType: !209, size: 16, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !235, file: !214, line: 419, baseType: !209, size: 16, offset: 240)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !235, file: !214, line: 420, baseType: !209, size: 16, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !235, file: !214, line: 421, baseType: !209, size: 16, offset: 272)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !235, file: !214, line: 422, baseType: !209, size: 16, offset: 288)
!256 = !{!257, !441, !177, !443, !446, !448}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "__global_locale", scope: !179, file: !214, line: 377, type: !259, isLocal: false, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !183, line: 330, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !183, line: 154, size: 26560, elements: !262)
!262 = !{!263, !270, !276, !277, !281, !283, !284, !288, !292, !294, !295, !296, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !261, file: !183, line: 156, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !267, line: 38, baseType: !268)
!267 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/tmp/klee-uclibc-130")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !269, line: 44, baseType: !94)
!269 = !DIFile(filename: "./include/bits/types.h", directory: "/tmp/klee-uclibc-130")
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !261, file: !183, line: 157, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !267, line: 42, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !269, line: 43, baseType: !275)
!275 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !261, file: !183, line: 158, baseType: !271, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !261, file: !183, line: 162, baseType: !278, size: 6144, offset: 192)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 6144, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !261, file: !183, line: 163, baseType: !282, size: 6144, offset: 6336)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 6144, elements: !279)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !261, file: !183, line: 164, baseType: !282, size: 6144, offset: 12480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !261, file: !183, line: 168, baseType: !285, size: 112, offset: 18624)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 14)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !261, file: !183, line: 174, baseType: !289, size: 96, offset: 18736)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 6)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !261, file: !183, line: 175, baseType: !293, size: 48, offset: 18832)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !290)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !261, file: !183, line: 178, baseType: !96, size: 8, offset: 18880)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !261, file: !183, line: 179, baseType: !96, size: 8, offset: 18888)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !261, file: !183, line: 180, baseType: !297, size: 80, offset: 18896)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 80, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 10)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !261, file: !183, line: 183, baseType: !205, size: 64, offset: 19008)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !261, file: !183, line: 184, baseType: !205, size: 64, offset: 19072)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !261, file: !183, line: 185, baseType: !205, size: 64, offset: 19136)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !261, file: !183, line: 186, baseType: !205, size: 64, offset: 19200)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !261, file: !183, line: 188, baseType: !205, size: 64, offset: 19264)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !261, file: !183, line: 189, baseType: !207, size: 64, offset: 19328)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !261, file: !183, line: 190, baseType: !205, size: 64, offset: 19392)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !261, file: !183, line: 191, baseType: !205, size: 64, offset: 19456)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !261, file: !183, line: 197, baseType: !207, size: 64, offset: 19520)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !261, file: !183, line: 199, baseType: !205, size: 64, offset: 19584)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !261, file: !183, line: 200, baseType: !205, size: 64, offset: 19648)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !261, file: !183, line: 202, baseType: !312, size: 64, offset: 19712)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !275)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !261, file: !183, line: 205, baseType: !316, size: 32, offset: 19776)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !261, file: !183, line: 206, baseType: !316, size: 32, offset: 19808)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !261, file: !183, line: 207, baseType: !45, size: 32, offset: 19840)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !261, file: !183, line: 208, baseType: !45, size: 32, offset: 19872)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !261, file: !183, line: 213, baseType: !29, size: 64, offset: 19904)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !261, file: !183, line: 214, baseType: !29, size: 64, offset: 19968)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !261, file: !183, line: 215, baseType: !29, size: 64, offset: 20032)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !261, file: !183, line: 216, baseType: !29, size: 64, offset: 20096)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !261, file: !183, line: 217, baseType: !29, size: 64, offset: 20160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !261, file: !183, line: 218, baseType: !29, size: 64, offset: 20224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !261, file: !183, line: 219, baseType: !29, size: 64, offset: 20288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !261, file: !183, line: 220, baseType: !29, size: 64, offset: 20352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !261, file: !183, line: 221, baseType: !29, size: 64, offset: 20416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !261, file: !183, line: 222, baseType: !29, size: 64, offset: 20480)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !261, file: !183, line: 223, baseType: !29, size: 64, offset: 20544)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !261, file: !183, line: 226, baseType: !29, size: 64, offset: 20608)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !261, file: !183, line: 227, baseType: !29, size: 64, offset: 20672)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !261, file: !183, line: 228, baseType: !29, size: 64, offset: 20736)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !261, file: !183, line: 231, baseType: !29, size: 64, offset: 20800)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !261, file: !183, line: 232, baseType: !29, size: 64, offset: 20864)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !261, file: !183, line: 233, baseType: !29, size: 64, offset: 20928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !261, file: !183, line: 234, baseType: !29, size: 64, offset: 20992)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !261, file: !183, line: 235, baseType: !29, size: 64, offset: 21056)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !261, file: !183, line: 236, baseType: !29, size: 64, offset: 21120)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !261, file: !183, line: 237, baseType: !29, size: 64, offset: 21184)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !261, file: !183, line: 238, baseType: !29, size: 64, offset: 21248)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !261, file: !183, line: 239, baseType: !29, size: 64, offset: 21312)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !261, file: !183, line: 240, baseType: !29, size: 64, offset: 21376)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !261, file: !183, line: 241, baseType: !29, size: 64, offset: 21440)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !261, file: !183, line: 242, baseType: !29, size: 64, offset: 21504)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !261, file: !183, line: 243, baseType: !29, size: 64, offset: 21568)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !261, file: !183, line: 244, baseType: !29, size: 64, offset: 21632)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !261, file: !183, line: 245, baseType: !29, size: 64, offset: 21696)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !261, file: !183, line: 246, baseType: !29, size: 64, offset: 21760)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !261, file: !183, line: 247, baseType: !29, size: 64, offset: 21824)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !261, file: !183, line: 248, baseType: !29, size: 64, offset: 21888)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !261, file: !183, line: 249, baseType: !29, size: 64, offset: 21952)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !261, file: !183, line: 250, baseType: !29, size: 64, offset: 22016)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !261, file: !183, line: 251, baseType: !29, size: 64, offset: 22080)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !261, file: !183, line: 253, baseType: !29, size: 64, offset: 22144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !261, file: !183, line: 256, baseType: !29, size: 64, offset: 22208)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !261, file: !183, line: 257, baseType: !29, size: 64, offset: 22272)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !261, file: !183, line: 258, baseType: !29, size: 64, offset: 22336)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !261, file: !183, line: 259, baseType: !29, size: 64, offset: 22400)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !261, file: !183, line: 260, baseType: !29, size: 64, offset: 22464)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !261, file: !183, line: 261, baseType: !29, size: 64, offset: 22528)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !261, file: !183, line: 262, baseType: !29, size: 64, offset: 22592)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !261, file: !183, line: 264, baseType: !29, size: 64, offset: 22656)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !261, file: !183, line: 265, baseType: !29, size: 64, offset: 22720)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !261, file: !183, line: 266, baseType: !29, size: 64, offset: 22784)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !261, file: !183, line: 267, baseType: !29, size: 64, offset: 22848)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !261, file: !183, line: 268, baseType: !29, size: 64, offset: 22912)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !261, file: !183, line: 269, baseType: !29, size: 64, offset: 22976)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !261, file: !183, line: 270, baseType: !29, size: 64, offset: 23040)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !261, file: !183, line: 272, baseType: !29, size: 64, offset: 23104)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !261, file: !183, line: 273, baseType: !29, size: 64, offset: 23168)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !261, file: !183, line: 274, baseType: !29, size: 64, offset: 23232)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !261, file: !183, line: 275, baseType: !29, size: 64, offset: 23296)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !261, file: !183, line: 276, baseType: !29, size: 64, offset: 23360)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !261, file: !183, line: 277, baseType: !29, size: 64, offset: 23424)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !261, file: !183, line: 278, baseType: !29, size: 64, offset: 23488)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !261, file: !183, line: 279, baseType: !29, size: 64, offset: 23552)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !261, file: !183, line: 280, baseType: !29, size: 64, offset: 23616)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !261, file: !183, line: 281, baseType: !29, size: 64, offset: 23680)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !261, file: !183, line: 282, baseType: !29, size: 64, offset: 23744)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !261, file: !183, line: 283, baseType: !29, size: 64, offset: 23808)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !261, file: !183, line: 285, baseType: !29, size: 64, offset: 23872)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !261, file: !183, line: 286, baseType: !29, size: 64, offset: 23936)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !261, file: !183, line: 287, baseType: !29, size: 64, offset: 24000)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !261, file: !183, line: 288, baseType: !29, size: 64, offset: 24064)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !261, file: !183, line: 289, baseType: !29, size: 64, offset: 24128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !261, file: !183, line: 290, baseType: !29, size: 64, offset: 24192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !261, file: !183, line: 291, baseType: !29, size: 64, offset: 24256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !261, file: !183, line: 292, baseType: !29, size: 64, offset: 24320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !261, file: !183, line: 293, baseType: !29, size: 64, offset: 24384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !261, file: !183, line: 294, baseType: !29, size: 64, offset: 24448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !261, file: !183, line: 295, baseType: !29, size: 64, offset: 24512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !261, file: !183, line: 296, baseType: !29, size: 64, offset: 24576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !261, file: !183, line: 298, baseType: !29, size: 64, offset: 24640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !261, file: !183, line: 299, baseType: !29, size: 64, offset: 24704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !261, file: !183, line: 301, baseType: !29, size: 64, offset: 24768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !261, file: !183, line: 302, baseType: !29, size: 64, offset: 24832)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !261, file: !183, line: 303, baseType: !29, size: 64, offset: 24896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !261, file: !183, line: 304, baseType: !29, size: 64, offset: 24960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !261, file: !183, line: 305, baseType: !29, size: 64, offset: 25024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !261, file: !183, line: 307, baseType: !29, size: 64, offset: 25088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !261, file: !183, line: 308, baseType: !29, size: 64, offset: 25152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !261, file: !183, line: 309, baseType: !29, size: 64, offset: 25216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !261, file: !183, line: 310, baseType: !29, size: 64, offset: 25280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !261, file: !183, line: 311, baseType: !29, size: 64, offset: 25344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !261, file: !183, line: 316, baseType: !29, size: 64, offset: 25408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !261, file: !183, line: 317, baseType: !29, size: 64, offset: 25472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !261, file: !183, line: 318, baseType: !29, size: 64, offset: 25536)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !261, file: !183, line: 319, baseType: !29, size: 64, offset: 25600)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !261, file: !183, line: 322, baseType: !411, size: 896, offset: 25664)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !183, line: 149, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 111, size: 896, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !439, !440}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !412, file: !183, line: 112, baseType: !209, size: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !412, file: !183, line: 113, baseType: !209, size: 16, offset: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !412, file: !183, line: 114, baseType: !209, size: 16, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !412, file: !183, line: 115, baseType: !209, size: 16, offset: 48)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !412, file: !183, line: 116, baseType: !209, size: 16, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !412, file: !183, line: 117, baseType: !209, size: 16, offset: 80)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !412, file: !183, line: 118, baseType: !209, size: 16, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !412, file: !183, line: 119, baseType: !209, size: 16, offset: 112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !412, file: !183, line: 120, baseType: !209, size: 16, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !412, file: !183, line: 121, baseType: !209, size: 16, offset: 144)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !412, file: !183, line: 122, baseType: !209, size: 16, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !412, file: !183, line: 123, baseType: !209, size: 16, offset: 176)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !412, file: !183, line: 124, baseType: !209, size: 16, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !412, file: !183, line: 125, baseType: !209, size: 16, offset: 208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !412, file: !183, line: 127, baseType: !209, size: 16, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !412, file: !183, line: 128, baseType: !209, size: 16, offset: 240)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !412, file: !183, line: 130, baseType: !207, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !412, file: !183, line: 131, baseType: !207, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !412, file: !183, line: 132, baseType: !207, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !412, file: !183, line: 135, baseType: !207, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !412, file: !183, line: 138, baseType: !207, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !412, file: !183, line: 141, baseType: !207, size: 64, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !412, file: !183, line: 142, baseType: !207, size: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !412, file: !183, line: 145, baseType: !438, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !412, file: !183, line: 146, baseType: !438, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !412, file: !183, line: 148, baseType: !209, size: 16, offset: 832)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !179, file: !214, line: 380, type: !259, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "utf8", scope: !179, file: !214, line: 387, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !290)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "ascii", scope: !179, file: !214, line: 388, type: !445, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "__code2flag", scope: !179, file: !214, line: 854, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 256, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 16)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !183, line: 324, baseType: !261)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !456, file: !457, line: 131, type: !501, isLocal: true, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/tmp/klee-uclibc-130")
!458 = !{!459, !491, !493, !495, !497, !499, !454}
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "stdin", scope: !456, file: !457, line: 154, type: !461, isLocal: false, isDefinition: true)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !463, line: 46, baseType: !464)
!463 = !DIFile(filename: "./include/stdio.h", directory: "/tmp/klee-uclibc-130")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !465, line: 233, size: 704, elements: !466)
!465 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/tmp/klee-uclibc-130")
!466 = !{!467, !468, !472, !473, !474, !475, !476, !477, !478, !479, !481, !483, !490}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !464, file: !465, line: 234, baseType: !94, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !464, file: !465, line: 237, baseType: !469, size: 16, offset: 16)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 2)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !464, file: !465, line: 244, baseType: !45, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !464, file: !465, line: 246, baseType: !211, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !464, file: !465, line: 247, baseType: !211, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !464, file: !465, line: 248, baseType: !211, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !464, file: !465, line: 249, baseType: !211, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !464, file: !465, line: 252, baseType: !211, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !464, file: !465, line: 255, baseType: !211, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !464, file: !465, line: 261, baseType: !480, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !464, file: !465, line: 268, baseType: !482, size: 64, offset: 512)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 64, elements: !470)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !464, file: !465, line: 271, baseType: !484, size: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !485, line: 85, baseType: !486)
!485 = !DIFile(filename: "./include/wchar.h", directory: "/tmp/klee-uclibc-130")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 81, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !486, file: !485, line: 83, baseType: !316, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !486, file: !485, line: 84, baseType: !316, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !464, file: !465, line: 274, baseType: !6, size: 64, offset: 640)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stdout", scope: !456, file: !457, line: 155, type: !461, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "stderr", scope: !456, file: !457, line: 156, type: !461, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdin", scope: !456, file: !457, line: 159, type: !461, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "__stdout", scope: !456, file: !457, line: 162, type: !461, isLocal: false, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !456, file: !457, line: 180, type: !461, isLocal: false, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 2112, elements: !137)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "default_file_list", scope: !504, file: !505, line: 939, type: !594, isLocal: true, isDefinition: true)
!504 = distinct !DISubprogram(name: "main", scope: !505, file: !505, line: 919, type: !506, scopeLine: 920, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !508, retainedNodes: !568)
!505 = !DIFile(filename: "../src/head.c", directory: "/coreutils/obj-llvm")
!506 = !DISubroutineType(types: !507)
!507 = !{!45, !45, !37}
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !509, retainedTypes: !534, globals: !539, splitDebugInlining: false, nameTableKind: None)
!509 = !{!510, !515, !529}
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "header_mode", file: !505, line: 65, baseType: !62, size: 32, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIEnumerator(name: "multiple_files", value: 0)
!513 = !DIEnumerator(name: "always", value: 1)
!514 = !DIEnumerator(name: "never", value: 2)
!515 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !516, line: 37, baseType: !62, size: 32, elements: !517)
!516 = !DIFile(filename: "../lib/quotearg.h", directory: "/coreutils/obj-llvm")
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!518 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!519 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!520 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!521 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!522 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!523 = !DIEnumerator(name: "c_quoting_style", value: 5)
!524 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!525 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!526 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!527 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!528 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!529 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Copy_fd_status", file: !505, line: 73, baseType: !62, size: 32, elements: !530)
!530 = !{!531, !532, !533}
!531 = !DIEnumerator(name: "COPY_FD_OK", value: 0)
!532 = !DIEnumerator(name: "COPY_FD_READ_ERROR", value: 1)
!533 = !DIEnumerator(name: "COPY_FD_UNEXPECTED_EOF", value: 2)
!534 = !{!29, !62, !7, !6, !535, !537, !23}
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !536, line: 63, baseType: !120)
!536 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!539 = !{!502, !540, !543, !545, !547, !549, !561}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !508, file: !505, line: 56, type: !542, isLocal: true, isDefinition: true)
!542 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "print_headers", scope: !508, file: !505, line: 59, type: !542, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "line_end", scope: !508, file: !505, line: 62, type: !8, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !508, file: !505, line: 71, type: !542, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "long_options", scope: !508, file: !505, line: 87, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 2560, elements: !298)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !554, line: 50, size: 256, elements: !555)
!554 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!555 = !{!556, !557, !558, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !553, file: !554, line: 52, baseType: !29, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !553, file: !554, line: 55, baseType: !45, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !553, file: !554, line: 56, baseType: !559, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !553, file: !554, line: 57, baseType: !45, size: 32, offset: 192)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "first_file", scope: !563, file: !505, line: 169, type: !542, isLocal: true, isDefinition: true)
!563 = distinct !DISubprogram(name: "write_header", scope: !505, file: !505, line: 167, type: !564, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !508, retainedNodes: !566)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !29}
!566 = !{!567}
!567 = !DILocalVariable(name: "filename", arg: 1, scope: !563, file: !505, line: 167, type: !29)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !579, !580, !581, !582, !585, !586, !587, !588}
!569 = !DILocalVariable(name: "argc", arg: 1, scope: !504, file: !505, line: 919, type: !45)
!570 = !DILocalVariable(name: "argv", arg: 2, scope: !504, file: !505, line: 919, type: !37)
!571 = !DILocalVariable(name: "header_mode", scope: !504, file: !505, line: 921, type: !510)
!572 = !DILocalVariable(name: "ok", scope: !504, file: !505, line: 922, type: !542)
!573 = !DILocalVariable(name: "c", scope: !504, file: !505, line: 923, type: !45)
!574 = !DILocalVariable(name: "i", scope: !504, file: !505, line: 924, type: !23)
!575 = !DILocalVariable(name: "n_units", scope: !504, file: !505, line: 927, type: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !577, line: 102, baseType: !578)
!577 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !85, line: 73, baseType: !10)
!579 = !DILocalVariable(name: "count_lines", scope: !504, file: !505, line: 931, type: !542)
!580 = !DILocalVariable(name: "elide_from_end", scope: !504, file: !505, line: 935, type: !542)
!581 = !DILocalVariable(name: "file_list", scope: !504, file: !505, line: 940, type: !537)
!582 = !DILocalVariable(name: "a", scope: !583, file: !505, line: 958, type: !7)
!583 = distinct !DILexicalBlock(scope: !584, file: !505, line: 957, column: 5)
!584 = distinct !DILexicalBlock(scope: !504, file: !505, line: 956, column: 7)
!585 = !DILocalVariable(name: "n_string", scope: !583, file: !505, line: 959, type: !7)
!586 = !DILocalVariable(name: "end_n_string", scope: !583, file: !505, line: 960, type: !7)
!587 = !DILocalVariable(name: "multiplier_char", scope: !583, file: !505, line: 961, type: !8)
!588 = !DILocalVariable(name: "umax_buf", scope: !589, file: !505, line: 1079, type: !591)
!589 = distinct !DILexicalBlock(scope: !590, file: !505, line: 1078, column: 5)
!590 = distinct !DILexicalBlock(scope: !504, file: !505, line: 1077, column: 8)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 168, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 21)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 128, elements: !470)
!595 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!596 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!597 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 10, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!598 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!599 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "program_name", scope: !602, file: !603, line: 33, type: !29, isLocal: false, isDefinition: true)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !604, globals: !605, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "../lib/progname.c", directory: "/coreutils/obj-llvm")
!604 = !{!6, !7}
!605 = !{!600}
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !608, file: !609, line: 108, type: !631, isLocal: true, isDefinition: true)
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !610, retainedTypes: !618, globals: !619, splitDebugInlining: false, nameTableKind: None)
!609 = !DIFile(filename: "../lib/quotearg.c", directory: "/coreutils/obj-llvm")
!610 = !{!515, !611, !616}
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !516, line: 247, baseType: !62, size: 32, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!614 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!615 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!616 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !617, line: 46, baseType: !62, size: 32, elements: !190)
!617 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!618 = !{!45, !94, !23, !29}
!619 = !{!620, !625, !629, !606, !641, !643, !650, !652}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !608, file: !609, line: 77, type: !622, isLocal: false, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 704, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 11)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !608, file: !609, line: 93, type: !627, isLocal: false, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 320, elements: !298)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !608, file: !609, line: 1047, type: !631, isLocal: false, isDefinition: true)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !609, line: 57, size: 448, elements: !632)
!632 = !{!633, !634, !635, !639, !640}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !631, file: !609, line: 60, baseType: !515, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !631, file: !609, line: 63, baseType: !45, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !631, file: !609, line: 67, baseType: !636, size: 256, offset: 64)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 8)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !631, file: !609, line: 70, baseType: !29, size: 64, offset: 320)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !631, file: !609, line: 73, baseType: !29, size: 64, offset: 384)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "slot0", scope: !608, file: !609, line: 837, type: !98, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "slotvec", scope: !608, file: !609, line: 840, type: !645, isLocal: true, isDefinition: true)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !609, line: 829, size: 128, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !646, file: !609, line: 831, baseType: !23, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !646, file: !609, line: 832, baseType: !7, size: 64, offset: 64)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "nslots", scope: !608, file: !609, line: 838, type: !45, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "slotvec0", scope: !608, file: !609, line: 839, type: !646, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !656, file: !657, line: 26, type: !659, isLocal: false, isDefinition: true)
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !658, splitDebugInlining: false, nameTableKind: None)
!657 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/coreutils/obj-llvm")
!658 = !{!654}
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 47)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "exit_failure", scope: !664, file: !665, line: 24, type: !667, isLocal: false, isDefinition: true)
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !666, splitDebugInlining: false, nameTableKind: None)
!665 = !DIFile(filename: "../lib/exitfail.c", directory: "/coreutils/obj-llvm")
!666 = !{!662}
!667 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "internal_state", scope: !670, file: !671, line: 93, type: !674, isLocal: true, isDefinition: true)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !672, globals: !673, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "../lib/mbrtoc32.c", directory: "/coreutils/obj-llvm")
!672 = !{!6, !23, !96}
!673 = !{!668}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !675, line: 6, baseType: !676)
!675 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !677, line: 21, baseType: !678)
!677 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !677, line: 13, size: 64, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !678, file: !677, line: 15, baseType: !45, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !678, file: !677, line: 20, baseType: !682, size: 32, offset: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !678, file: !677, line: 16, size: 32, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !682, file: !677, line: 18, baseType: !62, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !682, file: !677, line: 19, baseType: !686, size: 32)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 4)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "posix", scope: !691, file: !214, line: 1093, type: !445, isLocal: true, isDefinition: true)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !693, globals: !694, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "libc/misc/locale/newlocale.c", directory: "/tmp/klee-uclibc-130")
!693 = !{!62, !7, !6, !23, !211, !45}
!694 = !{!695, !689, !853}
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "envstr", scope: !697, file: !214, line: 1269, type: !852, isLocal: true, isDefinition: true)
!697 = distinct !DISubprogram(name: "newlocale", scope: !214, file: !214, line: 1243, type: !698, scopeLine: 1244, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !691, retainedNodes: !4)
!698 = !DISubroutineType(types: !699)
!699 = !{!700, !45, !29, !700}
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !183, line: 330, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !183, line: 154, size: 26560, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !702, file: !183, line: 156, baseType: !264, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !702, file: !183, line: 157, baseType: !271, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !702, file: !183, line: 158, baseType: !271, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !702, file: !183, line: 162, baseType: !278, size: 6144, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !702, file: !183, line: 163, baseType: !282, size: 6144, offset: 6336)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !702, file: !183, line: 164, baseType: !282, size: 6144, offset: 12480)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !702, file: !183, line: 168, baseType: !285, size: 112, offset: 18624)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !702, file: !183, line: 174, baseType: !289, size: 96, offset: 18736)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !702, file: !183, line: 175, baseType: !293, size: 48, offset: 18832)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !702, file: !183, line: 178, baseType: !96, size: 8, offset: 18880)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !702, file: !183, line: 179, baseType: !96, size: 8, offset: 18888)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !702, file: !183, line: 180, baseType: !297, size: 80, offset: 18896)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !702, file: !183, line: 183, baseType: !205, size: 64, offset: 19008)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !702, file: !183, line: 184, baseType: !205, size: 64, offset: 19072)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !702, file: !183, line: 185, baseType: !205, size: 64, offset: 19136)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !702, file: !183, line: 186, baseType: !205, size: 64, offset: 19200)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !702, file: !183, line: 188, baseType: !205, size: 64, offset: 19264)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !702, file: !183, line: 189, baseType: !207, size: 64, offset: 19328)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !702, file: !183, line: 190, baseType: !205, size: 64, offset: 19392)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !702, file: !183, line: 191, baseType: !205, size: 64, offset: 19456)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !702, file: !183, line: 197, baseType: !207, size: 64, offset: 19520)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !702, file: !183, line: 199, baseType: !205, size: 64, offset: 19584)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !702, file: !183, line: 200, baseType: !205, size: 64, offset: 19648)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !702, file: !183, line: 202, baseType: !312, size: 64, offset: 19712)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !702, file: !183, line: 205, baseType: !316, size: 32, offset: 19776)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !702, file: !183, line: 206, baseType: !316, size: 32, offset: 19808)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !702, file: !183, line: 207, baseType: !45, size: 32, offset: 19840)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !702, file: !183, line: 208, baseType: !45, size: 32, offset: 19872)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !702, file: !183, line: 213, baseType: !29, size: 64, offset: 19904)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !702, file: !183, line: 214, baseType: !29, size: 64, offset: 19968)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !702, file: !183, line: 215, baseType: !29, size: 64, offset: 20032)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !702, file: !183, line: 216, baseType: !29, size: 64, offset: 20096)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !702, file: !183, line: 217, baseType: !29, size: 64, offset: 20160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !702, file: !183, line: 218, baseType: !29, size: 64, offset: 20224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !702, file: !183, line: 219, baseType: !29, size: 64, offset: 20288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !702, file: !183, line: 220, baseType: !29, size: 64, offset: 20352)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !702, file: !183, line: 221, baseType: !29, size: 64, offset: 20416)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !702, file: !183, line: 222, baseType: !29, size: 64, offset: 20480)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !702, file: !183, line: 223, baseType: !29, size: 64, offset: 20544)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !702, file: !183, line: 226, baseType: !29, size: 64, offset: 20608)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !702, file: !183, line: 227, baseType: !29, size: 64, offset: 20672)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !702, file: !183, line: 228, baseType: !29, size: 64, offset: 20736)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !702, file: !183, line: 231, baseType: !29, size: 64, offset: 20800)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !702, file: !183, line: 232, baseType: !29, size: 64, offset: 20864)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !702, file: !183, line: 233, baseType: !29, size: 64, offset: 20928)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !702, file: !183, line: 234, baseType: !29, size: 64, offset: 20992)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !702, file: !183, line: 235, baseType: !29, size: 64, offset: 21056)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !702, file: !183, line: 236, baseType: !29, size: 64, offset: 21120)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !702, file: !183, line: 237, baseType: !29, size: 64, offset: 21184)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !702, file: !183, line: 238, baseType: !29, size: 64, offset: 21248)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !702, file: !183, line: 239, baseType: !29, size: 64, offset: 21312)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !702, file: !183, line: 240, baseType: !29, size: 64, offset: 21376)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !702, file: !183, line: 241, baseType: !29, size: 64, offset: 21440)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !702, file: !183, line: 242, baseType: !29, size: 64, offset: 21504)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !702, file: !183, line: 243, baseType: !29, size: 64, offset: 21568)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !702, file: !183, line: 244, baseType: !29, size: 64, offset: 21632)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !702, file: !183, line: 245, baseType: !29, size: 64, offset: 21696)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !702, file: !183, line: 246, baseType: !29, size: 64, offset: 21760)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !702, file: !183, line: 247, baseType: !29, size: 64, offset: 21824)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !702, file: !183, line: 248, baseType: !29, size: 64, offset: 21888)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !702, file: !183, line: 249, baseType: !29, size: 64, offset: 21952)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !702, file: !183, line: 250, baseType: !29, size: 64, offset: 22016)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !702, file: !183, line: 251, baseType: !29, size: 64, offset: 22080)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !702, file: !183, line: 253, baseType: !29, size: 64, offset: 22144)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !702, file: !183, line: 256, baseType: !29, size: 64, offset: 22208)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !702, file: !183, line: 257, baseType: !29, size: 64, offset: 22272)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !702, file: !183, line: 258, baseType: !29, size: 64, offset: 22336)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !702, file: !183, line: 259, baseType: !29, size: 64, offset: 22400)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !702, file: !183, line: 260, baseType: !29, size: 64, offset: 22464)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !702, file: !183, line: 261, baseType: !29, size: 64, offset: 22528)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !702, file: !183, line: 262, baseType: !29, size: 64, offset: 22592)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !702, file: !183, line: 264, baseType: !29, size: 64, offset: 22656)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !702, file: !183, line: 265, baseType: !29, size: 64, offset: 22720)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !702, file: !183, line: 266, baseType: !29, size: 64, offset: 22784)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !702, file: !183, line: 267, baseType: !29, size: 64, offset: 22848)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !702, file: !183, line: 268, baseType: !29, size: 64, offset: 22912)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !702, file: !183, line: 269, baseType: !29, size: 64, offset: 22976)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !702, file: !183, line: 270, baseType: !29, size: 64, offset: 23040)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !702, file: !183, line: 272, baseType: !29, size: 64, offset: 23104)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !702, file: !183, line: 273, baseType: !29, size: 64, offset: 23168)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !702, file: !183, line: 274, baseType: !29, size: 64, offset: 23232)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !702, file: !183, line: 275, baseType: !29, size: 64, offset: 23296)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !702, file: !183, line: 276, baseType: !29, size: 64, offset: 23360)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !702, file: !183, line: 277, baseType: !29, size: 64, offset: 23424)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !702, file: !183, line: 278, baseType: !29, size: 64, offset: 23488)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !702, file: !183, line: 279, baseType: !29, size: 64, offset: 23552)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !702, file: !183, line: 280, baseType: !29, size: 64, offset: 23616)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !702, file: !183, line: 281, baseType: !29, size: 64, offset: 23680)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !702, file: !183, line: 282, baseType: !29, size: 64, offset: 23744)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !702, file: !183, line: 283, baseType: !29, size: 64, offset: 23808)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !702, file: !183, line: 285, baseType: !29, size: 64, offset: 23872)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !702, file: !183, line: 286, baseType: !29, size: 64, offset: 23936)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !702, file: !183, line: 287, baseType: !29, size: 64, offset: 24000)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !702, file: !183, line: 288, baseType: !29, size: 64, offset: 24064)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !702, file: !183, line: 289, baseType: !29, size: 64, offset: 24128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !702, file: !183, line: 290, baseType: !29, size: 64, offset: 24192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !702, file: !183, line: 291, baseType: !29, size: 64, offset: 24256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !702, file: !183, line: 292, baseType: !29, size: 64, offset: 24320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !702, file: !183, line: 293, baseType: !29, size: 64, offset: 24384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !702, file: !183, line: 294, baseType: !29, size: 64, offset: 24448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !702, file: !183, line: 295, baseType: !29, size: 64, offset: 24512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !702, file: !183, line: 296, baseType: !29, size: 64, offset: 24576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !702, file: !183, line: 298, baseType: !29, size: 64, offset: 24640)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !702, file: !183, line: 299, baseType: !29, size: 64, offset: 24704)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !702, file: !183, line: 301, baseType: !29, size: 64, offset: 24768)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !702, file: !183, line: 302, baseType: !29, size: 64, offset: 24832)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !702, file: !183, line: 303, baseType: !29, size: 64, offset: 24896)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !702, file: !183, line: 304, baseType: !29, size: 64, offset: 24960)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !702, file: !183, line: 305, baseType: !29, size: 64, offset: 25024)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !702, file: !183, line: 307, baseType: !29, size: 64, offset: 25088)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !702, file: !183, line: 308, baseType: !29, size: 64, offset: 25152)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !702, file: !183, line: 309, baseType: !29, size: 64, offset: 25216)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !702, file: !183, line: 310, baseType: !29, size: 64, offset: 25280)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !702, file: !183, line: 311, baseType: !29, size: 64, offset: 25344)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !702, file: !183, line: 316, baseType: !29, size: 64, offset: 25408)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !702, file: !183, line: 317, baseType: !29, size: 64, offset: 25472)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !702, file: !183, line: 318, baseType: !29, size: 64, offset: 25536)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !702, file: !183, line: 319, baseType: !29, size: 64, offset: 25600)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !702, file: !183, line: 322, baseType: !823, size: 896, offset: 25664)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !183, line: 149, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 111, size: 896, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !824, file: !183, line: 112, baseType: !209, size: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !824, file: !183, line: 113, baseType: !209, size: 16, offset: 16)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !824, file: !183, line: 114, baseType: !209, size: 16, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !824, file: !183, line: 115, baseType: !209, size: 16, offset: 48)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !824, file: !183, line: 116, baseType: !209, size: 16, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !824, file: !183, line: 117, baseType: !209, size: 16, offset: 80)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !824, file: !183, line: 118, baseType: !209, size: 16, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !824, file: !183, line: 119, baseType: !209, size: 16, offset: 112)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !824, file: !183, line: 120, baseType: !209, size: 16, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !824, file: !183, line: 121, baseType: !209, size: 16, offset: 144)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !824, file: !183, line: 122, baseType: !209, size: 16, offset: 160)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !824, file: !183, line: 123, baseType: !209, size: 16, offset: 176)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !824, file: !183, line: 124, baseType: !209, size: 16, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !824, file: !183, line: 125, baseType: !209, size: 16, offset: 208)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !824, file: !183, line: 127, baseType: !209, size: 16, offset: 224)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !824, file: !183, line: 128, baseType: !209, size: 16, offset: 240)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !824, file: !183, line: 130, baseType: !207, size: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !824, file: !183, line: 131, baseType: !207, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !824, file: !183, line: 132, baseType: !207, size: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !824, file: !183, line: 135, baseType: !207, size: 64, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !824, file: !183, line: 138, baseType: !207, size: 64, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !824, file: !183, line: 141, baseType: !207, size: 64, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !824, file: !183, line: 142, baseType: !207, size: 64, offset: 640)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !824, file: !183, line: 145, baseType: !438, size: 64, offset: 704)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !824, file: !183, line: 146, baseType: !438, size: 64, offset: 768)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !824, file: !183, line: 148, baseType: !209, size: 16, offset: 832)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !687)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "utf8", scope: !691, file: !214, line: 1094, type: !445, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "__exe_env", scope: !857, file: !862, line: 34, type: !909, isLocal: false, isDefinition: true)
!857 = distinct !DICompileUnit(language: DW_LANG_C89, file: !858, producer: "clang version 13.0.1 (https://github.com/llvm/llvm-project.git 75e33f71c2dae584b13a7d1186ae0a038ba98838)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !859, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "/tmp/klee_src/runtime/POSIX/fd_init.c", directory: "/tmp/klee_build130stp_z3/runtime/POSIX")
!859 = !{!855, !860}
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !857, file: !862, line: 21, type: !863, isLocal: false, isDefinition: true)
!862 = !DIFile(filename: "klee_src/runtime/POSIX/fd_init.c", directory: "/tmp")
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !61, line: 86, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 74, size: 832, elements: !865)
!865 = !{!866, !867, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !864, file: !61, line: 75, baseType: !62, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !864, file: !61, line: 76, baseType: !868, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !61, line: 56, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 52, size: 192, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !870, file: !61, line: 53, baseType: !62, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !870, file: !61, line: 54, baseType: !7, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !870, file: !61, line: 55, baseType: !875, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !103, line: 103, size: 1152, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !890, !895, !896, !897}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !876, file: !103, line: 108, baseType: !106, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !876, file: !103, line: 110, baseType: !91, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !876, file: !103, line: 111, baseType: !110, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !876, file: !103, line: 112, baseType: !112, size: 32, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !876, file: !103, line: 119, baseType: !114, size: 32, offset: 224)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !876, file: !103, line: 120, baseType: !116, size: 32, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !876, file: !103, line: 122, baseType: !45, size: 32, offset: 288)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !876, file: !103, line: 123, baseType: !106, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !876, file: !103, line: 124, baseType: !120, size: 64, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !876, file: !103, line: 130, baseType: !122, size: 64, offset: 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !876, file: !103, line: 131, baseType: !889, size: 64, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !85, line: 181, baseType: !81)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !876, file: !103, line: 139, baseType: !891, size: 128, offset: 576)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !891, file: !127, line: 16, baseType: !130, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !891, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
