; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"

%struct.__uclibc_locale_struct.207 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.206 }
%struct.__collate_t.206 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.574 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.574*, [2 x i32], %struct.__mbstate_t.573, i8* }
%struct.__mbstate_t.573 = type { i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/tmp/klee-uclibc-130")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/tmp/klee-uclibc-130")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/tmp/klee-uclibc-130")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 313, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 312, type: !55, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!54 = !DIFile(filename: "klee_src/runtime/POSIX/fd.c", directory: "/tmp")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "clang version 13.0.1 (https://github.com/llvm/llvm-project.git 75e33f71c2dae584b13a7d1186ae0a038ba98838)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/tmp/klee_src/runtime/POSIX/fd.c", directory: "/tmp/klee_build130stp_z3/runtime/POSIX")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "klee_src/runtime/POSIX/fd.h", directory: "/tmp")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !149, !156, !162, !167, !172}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 345, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 344, type: !143, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !6, !147}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !148, line: 46, baseType: !10)
!148 = !DIFile(filename: "llvm-130-install_O_D_A/lib/clang/13.0.1/include/stddef.h", directory: "/tmp")
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "n_calls", scope: !151, file: !54, line: 411, type: !45, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 410, type: !152, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!145, !45, !154, !147}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "n_calls", scope: !158, file: !54, line: 647, type: !45, isLocal: true, isDefinition: true)
!158 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 646, type: !159, scopeLine: 646, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!159 = !DISubroutineType(types: !160)
!160 = !{!45, !29, !161}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "n_calls", scope: !164, file: !54, line: 666, type: !45, isLocal: true, isDefinition: true)
!164 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 665, type: !165, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!165 = !DISubroutineType(types: !166)
!166 = !{!45, !45, !161}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "n_calls", scope: !169, file: !54, line: 752, type: !45, isLocal: true, isDefinition: true)
!169 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 751, type: !170, scopeLine: 751, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!170 = !DISubroutineType(types: !171)
!171 = !{!45, !45, !82}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "n_calls", scope: !174, file: !54, line: 1346, type: !45, isLocal: true, isDefinition: true)
!174 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1345, type: !175, scopeLine: 1345, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!175 = !DISubroutineType(types: !176)
!176 = !{!7, !7, !147}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !179, file: !214, line: 375, type: !453, isLocal: false, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !181, retainedTypes: !203, globals: !256, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/tmp/klee-uclibc-130")
!181 = !{!182, !188}
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 90, baseType: !62, size: 32, elements: !184)
!183 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/tmp/klee-uclibc-130")
!184 = !{!185, !186, !187}
!185 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!186 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!187 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 48, baseType: !62, size: 32, elements: !190)
!189 = !DIFile(filename: "./include/ctype.h", directory: "/tmp/klee-uclibc-130")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!191 = !DIEnumerator(name: "_ISupper", value: 256)
!192 = !DIEnumerator(name: "_ISlower", value: 512)
!193 = !DIEnumerator(name: "_ISalpha", value: 1024)
!194 = !DIEnumerator(name: "_ISdigit", value: 2048)
!195 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!196 = !DIEnumerator(name: "_ISspace", value: 8192)
!197 = !DIEnumerator(name: "_ISprint", value: 16384)
!198 = !DIEnumerator(name: "_ISgraph", value: 32768)
!199 = !DIEnumerator(name: "_ISblank", value: 1)
!200 = !DIEnumerator(name: "_IScntrl", value: 2)
!201 = !DIEnumerator(name: "_ISpunct", value: 4)
!202 = !DIEnumerator(name: "_ISalnum", value: 8)
!203 = !{!45, !204, !7, !205, !207, !210, !96, !211, !212, !225, !233, !10}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!210 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !214, line: 400, baseType: !215)
!214 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/tmp/klee-uclibc-130")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 390, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !215, file: !214, line: 391, baseType: !209, size: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !215, file: !214, line: 392, baseType: !209, size: 16, offset: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !215, file: !214, line: 393, baseType: !209, size: 16, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !215, file: !214, line: 394, baseType: !209, size: 16, offset: 48)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !215, file: !214, line: 396, baseType: !209, size: 16, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !215, file: !214, line: 397, baseType: !209, size: 16, offset: 80)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !215, file: !214, line: 398, baseType: !209, size: 16, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !215, file: !214, line: 399, baseType: !209, size: 16, offset: 112)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !214, line: 430, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 425, size: 64, elements: !228)
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !227, file: !214, line: 426, baseType: !209, size: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !227, file: !214, line: 427, baseType: !209, size: 16, offset: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !227, file: !214, line: 428, baseType: !209, size: 16, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !227, file: !214, line: 429, baseType: !209, size: 16, offset: 48)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !214, line: 423, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 402, size: 304, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !235, file: !214, line: 403, baseType: !209, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !235, file: !214, line: 404, baseType: !209, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !235, file: !214, line: 405, baseType: !209, size: 16, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !235, file: !214, line: 406, baseType: !209, size: 16, offset: 48)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !235, file: !214, line: 407, baseType: !209, size: 16, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !235, file: !214, line: 408, baseType: !209, size: 16, offset: 80)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !235, file: !214, line: 409, baseType: !209, size: 16, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !235, file: !214, line: 410, baseType: !209, size: 16, offset: 112)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !235, file: !214, line: 411, baseType: !209, size: 16, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !235, file: !214, line: 412, baseType: !209, size: 16, offset: 144)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !235, file: !214, line: 413, baseType: !209, size: 16, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !235, file: !214, line: 414, baseType: !209, size: 16, offset: 176)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !235, file: !214, line: 415, baseType: !209, size: 16, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !235, file: !214, line: 416, baseType: !209, size: 16, offset: 208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !235, file: !214, line: 418, baseType: !209, size: 16, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !235, file: !214, line: 419, baseType: !209, size: 16, offset: 240)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !235, file: !214, line: 420, baseType: !209, size: 16, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !235, file: !214, line: 421, baseType: !209, size: 16, offset: 272)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !235, file: !214, line: 422, baseType: !209, size: 16, offset: 288)
!256 = !{!257, !441, !177, !443, !446, !448}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "__global_locale", scope: !179, file: !214, line: 377, type: !259, isLocal: false, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !183, line: 330, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !183, line: 154, size: 26560, elements: !262)
!262 = !{!263, !270, !276, !277, !281, !283, !284, !288, !292, !294, !295, !296, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !261, file: !183, line: 156, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !267, line: 38, baseType: !268)
!267 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/tmp/klee-uclibc-130")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !269, line: 44, baseType: !94)
!269 = !DIFile(filename: "./include/bits/types.h", directory: "/tmp/klee-uclibc-130")
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !261, file: !183, line: 157, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !267, line: 42, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !269, line: 43, baseType: !275)
!275 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !261, file: !183, line: 158, baseType: !271, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !261, file: !183, line: 162, baseType: !278, size: 6144, offset: 192)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 6144, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !261, file: !183, line: 163, baseType: !282, size: 6144, offset: 6336)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 6144, elements: !279)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !261, file: !183, line: 164, baseType: !282, size: 6144, offset: 12480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !261, file: !183, line: 168, baseType: !285, size: 112, offset: 18624)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 14)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !261, file: !183, line: 174, baseType: !289, size: 96, offset: 18736)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 6)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !261, file: !183, line: 175, baseType: !293, size: 48, offset: 18832)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !290)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !261, file: !183, line: 178, baseType: !96, size: 8, offset: 18880)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !261, file: !183, line: 179, baseType: !96, size: 8, offset: 18888)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !261, file: !183, line: 180, baseType: !297, size: 80, offset: 18896)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 80, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 10)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !261, file: !183, line: 183, baseType: !205, size: 64, offset: 19008)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !261, file: !183, line: 184, baseType: !205, size: 64, offset: 19072)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !261, file: !183, line: 185, baseType: !205, size: 64, offset: 19136)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !261, file: !183, line: 186, baseType: !205, size: 64, offset: 19200)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !261, file: !183, line: 188, baseType: !205, size: 64, offset: 19264)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !261, file: !183, line: 189, baseType: !207, size: 64, offset: 19328)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !261, file: !183, line: 190, baseType: !205, size: 64, offset: 19392)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !261, file: !183, line: 191, baseType: !205, size: 64, offset: 19456)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !261, file: !183, line: 197, baseType: !207, size: 64, offset: 19520)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !261, file: !183, line: 199, baseType: !205, size: 64, offset: 19584)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !261, file: !183, line: 200, baseType: !205, size: 64, offset: 19648)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !261, file: !183, line: 202, baseType: !312, size: 64, offset: 19712)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !275)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !261, file: !183, line: 205, baseType: !316, size: 32, offset: 19776)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !261, file: !183, line: 206, baseType: !316, size: 32, offset: 19808)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !261, file: !183, line: 207, baseType: !45, size: 32, offset: 19840)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !261, file: !183, line: 208, baseType: !45, size: 32, offset: 19872)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !261, file: !183, line: 213, baseType: !29, size: 64, offset: 19904)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !261, file: !183, line: 214, baseType: !29, size: 64, offset: 19968)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !261, file: !183, line: 215, baseType: !29, size: 64, offset: 20032)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !261, file: !183, line: 216, baseType: !29, size: 64, offset: 20096)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !261, file: !183, line: 217, baseType: !29, size: 64, offset: 20160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !261, file: !183, line: 218, baseType: !29, size: 64, offset: 20224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !261, file: !183, line: 219, baseType: !29, size: 64, offset: 20288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !261, file: !183, line: 220, baseType: !29, size: 64, offset: 20352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !261, file: !183, line: 221, baseType: !29, size: 64, offset: 20416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !261, file: !183, line: 222, baseType: !29, size: 64, offset: 20480)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !261, file: !183, line: 223, baseType: !29, size: 64, offset: 20544)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !261, file: !183, line: 226, baseType: !29, size: 64, offset: 20608)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !261, file: !183, line: 227, baseType: !29, size: 64, offset: 20672)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !261, file: !183, line: 228, baseType: !29, size: 64, offset: 20736)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !261, file: !183, line: 231, baseType: !29, size: 64, offset: 20800)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !261, file: !183, line: 232, baseType: !29, size: 64, offset: 20864)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !261, file: !183, line: 233, baseType: !29, size: 64, offset: 20928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !261, file: !183, line: 234, baseType: !29, size: 64, offset: 20992)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !261, file: !183, line: 235, baseType: !29, size: 64, offset: 21056)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !261, file: !183, line: 236, baseType: !29, size: 64, offset: 21120)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !261, file: !183, line: 237, baseType: !29, size: 64, offset: 21184)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !261, file: !183, line: 238, baseType: !29, size: 64, offset: 21248)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !261, file: !183, line: 239, baseType: !29, size: 64, offset: 21312)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !261, file: !183, line: 240, baseType: !29, size: 64, offset: 21376)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !261, file: !183, line: 241, baseType: !29, size: 64, offset: 21440)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !261, file: !183, line: 242, baseType: !29, size: 64, offset: 21504)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !261, file: !183, line: 243, baseType: !29, size: 64, offset: 21568)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !261, file: !183, line: 244, baseType: !29, size: 64, offset: 21632)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !261, file: !183, line: 245, baseType: !29, size: 64, offset: 21696)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !261, file: !183, line: 246, baseType: !29, size: 64, offset: 21760)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !261, file: !183, line: 247, baseType: !29, size: 64, offset: 21824)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !261, file: !183, line: 248, baseType: !29, size: 64, offset: 21888)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !261, file: !183, line: 249, baseType: !29, size: 64, offset: 21952)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !261, file: !183, line: 250, baseType: !29, size: 64, offset: 22016)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !261, file: !183, line: 251, baseType: !29, size: 64, offset: 22080)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !261, file: !183, line: 253, baseType: !29, size: 64, offset: 22144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !261, file: !183, line: 256, baseType: !29, size: 64, offset: 22208)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !261, file: !183, line: 257, baseType: !29, size: 64, offset: 22272)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !261, file: !183, line: 258, baseType: !29, size: 64, offset: 22336)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !261, file: !183, line: 259, baseType: !29, size: 64, offset: 22400)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !261, file: !183, line: 260, baseType: !29, size: 64, offset: 22464)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !261, file: !183, line: 261, baseType: !29, size: 64, offset: 22528)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !261, file: !183, line: 262, baseType: !29, size: 64, offset: 22592)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !261, file: !183, line: 264, baseType: !29, size: 64, offset: 22656)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !261, file: !183, line: 265, baseType: !29, size: 64, offset: 22720)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !261, file: !183, line: 266, baseType: !29, size: 64, offset: 22784)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !261, file: !183, line: 267, baseType: !29, size: 64, offset: 22848)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !261, file: !183, line: 268, baseType: !29, size: 64, offset: 22912)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !261, file: !183, line: 269, baseType: !29, size: 64, offset: 22976)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !261, file: !183, line: 270, baseType: !29, size: 64, offset: 23040)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !261, file: !183, line: 272, baseType: !29, size: 64, offset: 23104)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !261, file: !183, line: 273, baseType: !29, size: 64, offset: 23168)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !261, file: !183, line: 274, baseType: !29, size: 64, offset: 23232)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !261, file: !183, line: 275, baseType: !29, size: 64, offset: 23296)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !261, file: !183, line: 276, baseType: !29, size: 64, offset: 23360)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !261, file: !183, line: 277, baseType: !29, size: 64, offset: 23424)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !261, file: !183, line: 278, baseType: !29, size: 64, offset: 23488)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !261, file: !183, line: 279, baseType: !29, size: 64, offset: 23552)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !261, file: !183, line: 280, baseType: !29, size: 64, offset: 23616)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !261, file: !183, line: 281, baseType: !29, size: 64, offset: 23680)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !261, file: !183, line: 282, baseType: !29, size: 64, offset: 23744)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !261, file: !183, line: 283, baseType: !29, size: 64, offset: 23808)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !261, file: !183, line: 285, baseType: !29, size: 64, offset: 23872)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !261, file: !183, line: 286, baseType: !29, size: 64, offset: 23936)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !261, file: !183, line: 287, baseType: !29, size: 64, offset: 24000)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !261, file: !183, line: 288, baseType: !29, size: 64, offset: 24064)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !261, file: !183, line: 289, baseType: !29, size: 64, offset: 24128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !261, file: !183, line: 290, baseType: !29, size: 64, offset: 24192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !261, file: !183, line: 291, baseType: !29, size: 64, offset: 24256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !261, file: !183, line: 292, baseType: !29, size: 64, offset: 24320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !261, file: !183, line: 293, baseType: !29, size: 64, offset: 24384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !261, file: !183, line: 294, baseType: !29, size: 64, offset: 24448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !261, file: !183, line: 295, baseType: !29, size: 64, offset: 24512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !261, file: !183, line: 296, baseType: !29, size: 64, offset: 24576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !261, file: !183, line: 298, baseType: !29, size: 64, offset: 24640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !261, file: !183, line: 299, baseType: !29, size: 64, offset: 24704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !261, file: !183, line: 301, baseType: !29, size: 64, offset: 24768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !261, file: !183, line: 302, baseType: !29, size: 64, offset: 24832)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !261, file: !183, line: 303, baseType: !29, size: 64, offset: 24896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !261, file: !183, line: 304, baseType: !29, size: 64, offset: 24960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !261, file: !183, line: 305, baseType: !29, size: 64, offset: 25024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !261, file: !183, line: 307, baseType: !29, size: 64, offset: 25088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !261, file: !183, line: 308, baseType: !29, size: 64, offset: 25152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !261, file: !183, line: 309, baseType: !29, size: 64, offset: 25216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !261, file: !183, line: 310, baseType: !29, size: 64, offset: 25280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !261, file: !183, line: 311, baseType: !29, size: 64, offset: 25344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !261, file: !183, line: 316, baseType: !29, size: 64, offset: 25408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !261, file: !183, line: 317, baseType: !29, size: 64, offset: 25472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !261, file: !183, line: 318, baseType: !29, size: 64, offset: 25536)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !261, file: !183, line: 319, baseType: !29, size: 64, offset: 25600)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !261, file: !183, line: 322, baseType: !411, size: 896, offset: 25664)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !183, line: 149, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 111, size: 896, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !439, !440}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !412, file: !183, line: 112, baseType: !209, size: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !412, file: !183, line: 113, baseType: !209, size: 16, offset: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !412, file: !183, line: 114, baseType: !209, size: 16, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !412, file: !183, line: 115, baseType: !209, size: 16, offset: 48)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !412, file: !183, line: 116, baseType: !209, size: 16, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !412, file: !183, line: 117, baseType: !209, size: 16, offset: 80)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !412, file: !183, line: 118, baseType: !209, size: 16, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !412, file: !183, line: 119, baseType: !209, size: 16, offset: 112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !412, file: !183, line: 120, baseType: !209, size: 16, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !412, file: !183, line: 121, baseType: !209, size: 16, offset: 144)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !412, file: !183, line: 122, baseType: !209, size: 16, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !412, file: !183, line: 123, baseType: !209, size: 16, offset: 176)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !412, file: !183, line: 124, baseType: !209, size: 16, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !412, file: !183, line: 125, baseType: !209, size: 16, offset: 208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !412, file: !183, line: 127, baseType: !209, size: 16, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !412, file: !183, line: 128, baseType: !209, size: 16, offset: 240)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !412, file: !183, line: 130, baseType: !207, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !412, file: !183, line: 131, baseType: !207, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !412, file: !183, line: 132, baseType: !207, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !412, file: !183, line: 135, baseType: !207, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !412, file: !183, line: 138, baseType: !207, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !412, file: !183, line: 141, baseType: !207, size: 64, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !412, file: !183, line: 142, baseType: !207, size: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !412, file: !183, line: 145, baseType: !438, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !412, file: !183, line: 146, baseType: !438, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !412, file: !183, line: 148, baseType: !209, size: 16, offset: 832)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !179, file: !214, line: 380, type: !259, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "utf8", scope: !179, file: !214, line: 387, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !290)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "ascii", scope: !179, file: !214, line: 388, type: !445, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "__code2flag", scope: !179, file: !214, line: 854, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 256, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 16)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !183, line: 324, baseType: !261)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !456, file: !457, line: 131, type: !501, isLocal: true, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/tmp/klee-uclibc-130")
!458 = !{!459, !491, !493, !495, !497, !499, !454}
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "stdin", scope: !456, file: !457, line: 154, type: !461, isLocal: false, isDefinition: true)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !463, line: 46, baseType: !464)
!463 = !DIFile(filename: "./include/stdio.h", directory: "/tmp/klee-uclibc-130")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !465, line: 233, size: 704, elements: !466)
!465 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/tmp/klee-uclibc-130")
!466 = !{!467, !468, !472, !473, !474, !475, !476, !477, !478, !479, !481, !483, !490}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !464, file: !465, line: 234, baseType: !94, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !464, file: !465, line: 237, baseType: !469, size: 16, offset: 16)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 2)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !464, file: !465, line: 244, baseType: !45, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !464, file: !465, line: 246, baseType: !211, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !464, file: !465, line: 247, baseType: !211, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !464, file: !465, line: 248, baseType: !211, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !464, file: !465, line: 249, baseType: !211, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !464, file: !465, line: 252, baseType: !211, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !464, file: !465, line: 255, baseType: !211, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !464, file: !465, line: 261, baseType: !480, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !464, file: !465, line: 268, baseType: !482, size: 64, offset: 512)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 64, elements: !470)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !464, file: !465, line: 271, baseType: !484, size: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !485, line: 85, baseType: !486)
!485 = !DIFile(filename: "./include/wchar.h", directory: "/tmp/klee-uclibc-130")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 81, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !486, file: !485, line: 83, baseType: !316, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !486, file: !485, line: 84, baseType: !316, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !464, file: !465, line: 274, baseType: !6, size: 64, offset: 640)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stdout", scope: !456, file: !457, line: 155, type: !461, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "stderr", scope: !456, file: !457, line: 156, type: !461, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdin", scope: !456, file: !457, line: 159, type: !461, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "__stdout", scope: !456, file: !457, line: 162, type: !461, isLocal: false, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !456, file: !457, line: 180, type: !461, isLocal: false, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 2112, elements: !137)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "page_size", scope: !504, file: !505, line: 88, type: !23, isLocal: true, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !506, retainedTypes: !545, globals: !547, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "../src/wc.c", directory: "/coreutils/obj-llvm")
!506 = !{!507, !521, !527, !534, !543}
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !508, line: 37, baseType: !62, size: 32, elements: !509)
!508 = !DIFile(filename: "../lib/quotearg.h", directory: "/coreutils/obj-llvm")
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!510 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!511 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!512 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!513 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!514 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!515 = !DIEnumerator(name: "c_quoting_style", value: 5)
!516 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!517 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!518 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!519 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!520 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!521 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "total_type", file: !505, line: 128, baseType: !62, size: 32, elements: !522)
!522 = !{!523, !524, !525, !526}
!523 = !DIEnumerator(name: "total_auto", value: 0)
!524 = !DIEnumerator(name: "total_always", value: 1)
!525 = !DIEnumerator(name: "total_only", value: 2)
!526 = !DIEnumerator(name: "total_never", value: 3)
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "argv_iter_err", file: !528, line: 29, baseType: !62, size: 32, elements: !529)
!528 = !DIFile(filename: "../lib/argv-iter.h", directory: "/coreutils/obj-llvm")
!529 = !{!530, !531, !532, !533}
!530 = !DIEnumerator(name: "AI_ERR_OK", value: 1)
!531 = !DIEnumerator(name: "AI_ERR_EOF", value: 2)
!532 = !DIEnumerator(name: "AI_ERR_MEM", value: 3)
!533 = !DIEnumerator(name: "AI_ERR_READ", value: 4)
!534 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !535, line: 44, baseType: !62, size: 32, elements: !536)
!535 = !DIFile(filename: "../lib/fadvise.h", directory: "/coreutils/obj-llvm")
!536 = !{!537, !538, !539, !540, !541, !542}
!537 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!538 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!539 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!540 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!541 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!542 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!543 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !544, line: 46, baseType: !62, size: 32, elements: !190)
!544 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!545 = !{!29, !6, !154, !7, !23, !96, !45, !94, !546}
!546 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!547 = !{!548, !720, !722, !727, !729, !731, !733, !735, !737, !739, !741, !743, !745, !747, !749, !751, !753, !755, !502, !757, !759, !773, !779, !785, !787, !870}
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "stdin_only", scope: !550, file: !505, line: 905, type: !719, isLocal: true, isDefinition: true)
!550 = distinct !DISubprogram(name: "main", scope: !505, file: !505, line: 778, type: !551, scopeLine: 779, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !504, retainedNodes: !553)
!551 = !DISubroutineType(types: !552)
!552 = !{!45, !45, !37}
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !588, !648, !649, !652, !705, !706, !708, !711, !712, !713, !718}
!554 = !DILocalVariable(name: "argc", arg: 1, scope: !550, file: !505, line: 778, type: !45)
!555 = !DILocalVariable(name: "argv", arg: 2, scope: !550, file: !505, line: 778, type: !37)
!556 = !DILocalVariable(name: "ok", scope: !550, file: !505, line: 780, type: !546)
!557 = !DILocalVariable(name: "optc", scope: !550, file: !505, line: 781, type: !45)
!558 = !DILocalVariable(name: "nfiles", scope: !550, file: !505, line: 782, type: !23)
!559 = !DILocalVariable(name: "files", scope: !550, file: !505, line: 783, type: !37)
!560 = !DILocalVariable(name: "files_from", scope: !550, file: !505, line: 784, type: !7)
!561 = !DILocalVariable(name: "fstatus", scope: !550, file: !505, line: 785, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !505, line: 94, size: 1216, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !563, file: !505, line: 98, baseType: !45, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !563, file: !505, line: 101, baseType: !567, size: 1152, offset: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !585, !586, !587}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !567, file: !103, line: 31, baseType: !106, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !567, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !567, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !567, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !567, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !567, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !567, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !567, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !567, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !567, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !567, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !567, file: !103, line: 74, baseType: !581, size: 128, offset: 576)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !581, file: !127, line: 16, baseType: !130, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !581, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !567, file: !103, line: 75, baseType: !581, size: 128, offset: 704)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !567, file: !103, line: 76, baseType: !581, size: 128, offset: 832)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !567, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!588 = !DILocalVariable(name: "tok", scope: !550, file: !505, line: 786, type: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !590, line: 27, size: 2304, elements: !591)
!590 = !DIFile(filename: "../lib/readtokens0.h", directory: "/coreutils/obj-llvm")
!591 = !{!592, !593, !594, !596, !646, !647}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !589, file: !590, line: 29, baseType: !23, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !589, file: !590, line: 30, baseType: !37, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !589, file: !590, line: 31, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !589, file: !590, line: 32, baseType: !597, size: 704, offset: 192)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !598, line: 178, size: 704, elements: !599)
!598 = !DIFile(filename: "../lib/obstack.h", directory: "/coreutils/obj-llvm")
!599 = !{!600, !601, !611, !612, !613, !614, !619, !620, !631, !642, !643, !644, !645}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !597, file: !598, line: 180, baseType: !23, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !597, file: !598, line: 181, baseType: !602, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !598, line: 171, size: 128, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !603, file: !598, line: 173, baseType: !7, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !603, file: !598, line: 174, baseType: !602, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !603, file: !598, line: 175, baseType: !608, offset: 128)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: -1)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !597, file: !598, line: 182, baseType: !7, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !597, file: !598, line: 183, baseType: !7, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !597, file: !598, line: 184, baseType: !7, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !597, file: !598, line: 189, baseType: !615, size: 64, offset: 320)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !597, file: !598, line: 185, size: 64, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !615, file: !598, line: 187, baseType: !23, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !615, file: !598, line: 188, baseType: !6, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !597, file: !598, line: 190, baseType: !23, size: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !597, file: !598, line: 197, baseType: !621, size: 64, offset: 448)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !597, file: !598, line: 193, size: 64, elements: !622)
!622 = !{!623, !627}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !621, file: !598, line: 195, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!6, !23}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !621, file: !598, line: 196, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!6, !6, !23}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !597, file: !598, line: 202, baseType: !632, size: 64, offset: 512)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !597, file: !598, line: 198, size: 64, elements: !633)
!633 = !{!634, !638}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !632, file: !598, line: 200, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !6}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !632, file: !598, line: 201, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !6, !6}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !597, file: !598, line: 204, baseType: !6, size: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !597, file: !598, line: 205, baseType: !62, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !597, file: !598, line: 206, baseType: !62, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !597, file: !598, line: 210, baseType: !62, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !589, file: !590, line: 33, baseType: !597, size: 704, offset: 896)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !589, file: !590, line: 34, baseType: !597, size: 704, offset: 1600)
!648 = !DILocalVariable(name: "read_tokens", scope: !550, file: !505, line: 854, type: !546)
!649 = !DILocalVariable(name: "ai", scope: !550, file: !505, line: 855, type: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !528, line: 27, flags: DIFlagFwdDecl)
!652 = !DILocalVariable(name: "stream", scope: !653, file: !505, line: 858, type: !655)
!653 = distinct !DILexicalBlock(scope: !654, file: !505, line: 857, column: 5)
!654 = distinct !DILexicalBlock(scope: !550, file: !505, line: 856, column: 7)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !657, line: 7, baseType: !658)
!657 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !659, line: 49, size: 1728, elements: !660)
!659 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !676, !678, !679, !680, !681, !682, !683, !687, !690, !691, !694, !697, !698, !699, !700, !701}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !658, file: !659, line: 51, baseType: !45, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !658, file: !659, line: 54, baseType: !7, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !658, file: !659, line: 55, baseType: !7, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !658, file: !659, line: 56, baseType: !7, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !658, file: !659, line: 57, baseType: !7, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !658, file: !659, line: 58, baseType: !7, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !658, file: !659, line: 59, baseType: !7, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !658, file: !659, line: 60, baseType: !7, size: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !658, file: !659, line: 61, baseType: !7, size: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !658, file: !659, line: 64, baseType: !7, size: 64, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !658, file: !659, line: 65, baseType: !7, size: 64, offset: 640)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !658, file: !659, line: 66, baseType: !7, size: 64, offset: 704)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !658, file: !659, line: 68, baseType: !674, size: 64, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !659, line: 36, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !658, file: !659, line: 70, baseType: !677, size: 64, offset: 832)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !658, file: !659, line: 72, baseType: !45, size: 32, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !658, file: !659, line: 73, baseType: !45, size: 32, offset: 928)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !658, file: !659, line: 74, baseType: !120, size: 64, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !658, file: !659, line: 77, baseType: !94, size: 16, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !658, file: !659, line: 78, baseType: !210, size: 8, offset: 1040)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !658, file: !659, line: 79, baseType: !684, size: 8, offset: 1048)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 1)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !658, file: !659, line: 81, baseType: !688, size: 64, offset: 1088)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !659, line: 43, baseType: null)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !658, file: !659, line: 89, baseType: !84, size: 64, offset: 1152)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !658, file: !659, line: 91, baseType: !692, size: 64, offset: 1216)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !659, line: 37, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !658, file: !659, line: 92, baseType: !695, size: 64, offset: 1280)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !659, line: 38, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !658, file: !659, line: 93, baseType: !677, size: 64, offset: 1344)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !658, file: !659, line: 94, baseType: !6, size: 64, offset: 1408)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !658, file: !659, line: 95, baseType: !23, size: 64, offset: 1472)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !658, file: !659, line: 96, baseType: !45, size: 32, offset: 1536)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !658, file: !659, line: 98, baseType: !702, size: 160, offset: 1568)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 20)
!705 = !DILocalVariable(name: "st", scope: !653, file: !505, line: 882, type: !567)
!706 = !DILocalVariable(name: "i", scope: !707, file: !505, line: 921, type: !45)
!707 = distinct !DILexicalBlock(scope: !550, file: !505, line: 921, column: 3)
!708 = !DILocalVariable(name: "skip_file", scope: !709, file: !505, line: 923, type: !546)
!709 = distinct !DILexicalBlock(scope: !710, file: !505, line: 922, column: 5)
!710 = distinct !DILexicalBlock(scope: !707, file: !505, line: 921, column: 3)
!711 = !DILocalVariable(name: "ai_err", scope: !709, file: !505, line: 924, type: !527)
!712 = !DILocalVariable(name: "file_name", scope: !709, file: !505, line: 925, type: !7)
!713 = !DILocalVariable(name: "file_number", scope: !714, file: !505, line: 966, type: !10)
!714 = distinct !DILexicalBlock(scope: !715, file: !505, line: 962, column: 13)
!715 = distinct !DILexicalBlock(scope: !716, file: !505, line: 959, column: 15)
!716 = distinct !DILexicalBlock(scope: !717, file: !505, line: 954, column: 9)
!717 = distinct !DILexicalBlock(scope: !709, file: !505, line: 953, column: 11)
!718 = !DILabel(scope: !550, name: "argv_iter_done", file: !505, line: 981)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !685)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "debug", scope: !504, file: !505, line: 63, type: !546, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "total_lines", scope: !504, file: !505, line: 67, type: !724, isLocal: true, isDefinition: true)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !725, line: 102, baseType: !726)
!725 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !85, line: 73, baseType: !10)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "total_words", scope: !504, file: !505, line: 68, type: !724, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "total_chars", scope: !504, file: !505, line: 69, type: !724, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "total_bytes", scope: !504, file: !505, line: 70, type: !724, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "total_lines_overflow", scope: !504, file: !505, line: 71, type: !724, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "total_words_overflow", scope: !504, file: !505, line: 72, type: !724, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "total_chars_overflow", scope: !504, file: !505, line: 73, type: !724, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "total_bytes_overflow", scope: !504, file: !505, line: 74, type: !724, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "max_line_length", scope: !504, file: !505, line: 75, type: !724, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "print_lines", scope: !504, file: !505, line: 78, type: !546, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "print_words", scope: !504, file: !505, line: 78, type: !546, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "print_chars", scope: !504, file: !505, line: 78, type: !546, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "print_bytes", scope: !504, file: !505, line: 78, type: !546, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "print_linelength", scope: !504, file: !505, line: 79, type: !546, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "number_width", scope: !504, file: !505, line: 82, type: !45, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !504, file: !505, line: 85, type: !546, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !504, file: !505, line: 91, type: !546, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "longopts", scope: !504, file: !505, line: 113, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 2816, elements: !771)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !764, line: 50, size: 256, elements: !765)
!764 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!765 = !{!766, !767, !768, !770}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !763, file: !764, line: 52, baseType: !29, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !763, file: !764, line: 55, baseType: !45, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !763, file: !764, line: 56, baseType: !769, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !763, file: !764, line: 57, baseType: !45, size: 32, offset: 192)
!771 = !{!772}
!772 = !DISubrange(count: 11)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "total_types", scope: !504, file: !505, line: 139, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 128, elements: !777)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!777 = !{!778}
!778 = !DISubrange(count: 4)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "total_args", scope: !504, file: !505, line: 135, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 320, elements: !783)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!783 = !{!784}
!784 = !DISubrange(count: 5)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "total_mode", scope: !504, file: !505, line: 144, type: !521, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "wc_lines_p", scope: !789, file: !505, line: 437, type: !866, isLocal: true, isDefinition: true)
!789 = distinct !DISubprogram(name: "wc", scope: !505, file: !505, line: 336, type: !790, scopeLine: 337, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !504, retainedNodes: !794)
!790 = !DISubroutineType(types: !791)
!791 = !{!546, !45, !29, !562, !792}
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !793, line: 63, baseType: !120)
!793 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!794 = !{!795, !796, !797, !798, !799, !800, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !817, !820, !823, !827, !828, !842, !843, !844, !846, !847, !849, !850, !851, !857, !859, !860, !862, !863}
!795 = !DILocalVariable(name: "fd", arg: 1, scope: !789, file: !505, line: 336, type: !45)
!796 = !DILocalVariable(name: "file_x", arg: 2, scope: !789, file: !505, line: 336, type: !29)
!797 = !DILocalVariable(name: "fstatus", arg: 3, scope: !789, file: !505, line: 336, type: !562)
!798 = !DILocalVariable(name: "current_pos", arg: 4, scope: !789, file: !505, line: 336, type: !792)
!799 = !DILocalVariable(name: "ok", scope: !789, file: !505, line: 338, type: !546)
!800 = !DILocalVariable(name: "buf", scope: !789, file: !505, line: 339, type: !801)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 131080, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 16385)
!804 = !DILocalVariable(name: "bytes_read", scope: !789, file: !505, line: 340, type: !23)
!805 = !DILocalVariable(name: "lines", scope: !789, file: !505, line: 341, type: !724)
!806 = !DILocalVariable(name: "words", scope: !789, file: !505, line: 341, type: !724)
!807 = !DILocalVariable(name: "chars", scope: !789, file: !505, line: 341, type: !724)
!808 = !DILocalVariable(name: "bytes", scope: !789, file: !505, line: 341, type: !724)
!809 = !DILocalVariable(name: "linelength", scope: !789, file: !505, line: 341, type: !724)
!810 = !DILocalVariable(name: "count_bytes", scope: !789, file: !505, line: 342, type: !546)
!811 = !DILocalVariable(name: "count_chars", scope: !789, file: !505, line: 342, type: !546)
!812 = !DILocalVariable(name: "count_complicated", scope: !789, file: !505, line: 342, type: !546)
!813 = !DILocalVariable(name: "file", scope: !789, file: !505, line: 343, type: !29)
!814 = !DILocalVariable(name: "skip_read", scope: !815, file: !505, line: 379, type: !546)
!815 = distinct !DILexicalBlock(scope: !816, file: !505, line: 378, column: 5)
!816 = distinct !DILexicalBlock(scope: !789, file: !505, line: 377, column: 7)
!817 = !DILocalVariable(name: "end_pos", scope: !818, file: !505, line: 390, type: !792)
!818 = distinct !DILexicalBlock(scope: !819, file: !505, line: 389, column: 9)
!819 = distinct !DILexicalBlock(scope: !815, file: !505, line: 387, column: 11)
!820 = !DILocalVariable(name: "hi_pos", scope: !821, file: !505, line: 412, type: !792)
!821 = distinct !DILexicalBlock(scope: !822, file: !505, line: 411, column: 13)
!822 = distinct !DILexicalBlock(scope: !818, file: !505, line: 394, column: 15)
!823 = !DILocalVariable(name: "in_word", scope: !824, file: !505, line: 453, type: !546)
!824 = distinct !DILexicalBlock(scope: !825, file: !505, line: 452, column: 5)
!825 = distinct !DILexicalBlock(scope: !826, file: !505, line: 451, column: 12)
!826 = distinct !DILexicalBlock(scope: !816, file: !505, line: 434, column: 12)
!827 = !DILocalVariable(name: "linepos", scope: !824, file: !505, line: 454, type: !724)
!828 = !DILocalVariable(name: "state", scope: !824, file: !505, line: 455, type: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !830, line: 6, baseType: !831)
!830 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !832, line: 21, baseType: !833)
!832 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !832, line: 13, size: 64, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !833, file: !832, line: 15, baseType: !45, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !833, file: !832, line: 20, baseType: !837, size: 32, offset: 32)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !833, file: !832, line: 16, size: 32, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !837, file: !832, line: 18, baseType: !62, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !837, file: !832, line: 19, baseType: !841, size: 32)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !777)
!842 = !DILocalVariable(name: "in_shift", scope: !824, file: !505, line: 456, type: !546)
!843 = !DILocalVariable(name: "prev", scope: !824, file: !505, line: 465, type: !23)
!844 = !DILocalVariable(name: "p", scope: !845, file: !505, line: 472, type: !29)
!845 = distinct !DILexicalBlock(scope: !824, file: !505, line: 471, column: 9)
!846 = !DILocalVariable(name: "backup_state", scope: !845, file: !505, line: 474, type: !829)
!847 = !DILocalVariable(name: "wide_char", scope: !848, file: !505, line: 488, type: !316)
!848 = distinct !DILexicalBlock(scope: !845, file: !505, line: 487, column: 13)
!849 = !DILocalVariable(name: "n", scope: !848, file: !505, line: 489, type: !23)
!850 = !DILocalVariable(name: "wide", scope: !848, file: !505, line: 490, type: !546)
!851 = !DILocalVariable(name: "width", scope: !852, file: !505, line: 562, type: !45)
!852 = distinct !DILexicalBlock(scope: !853, file: !505, line: 561, column: 25)
!853 = distinct !DILexicalBlock(scope: !854, file: !505, line: 560, column: 27)
!854 = distinct !DILexicalBlock(scope: !855, file: !505, line: 557, column: 21)
!855 = distinct !DILexicalBlock(scope: !856, file: !505, line: 556, column: 23)
!856 = distinct !DILexicalBlock(scope: !848, file: !505, line: 534, column: 17)
!857 = !DILocalVariable(name: "in_word", scope: !858, file: !505, line: 607, type: !546)
!858 = distinct !DILexicalBlock(scope: !825, file: !505, line: 606, column: 5)
!859 = !DILocalVariable(name: "linepos", scope: !858, file: !505, line: 608, type: !724)
!860 = !DILocalVariable(name: "p", scope: !861, file: !505, line: 612, type: !29)
!861 = distinct !DILexicalBlock(scope: !858, file: !505, line: 611, column: 9)
!862 = !DILabel(scope: !856, name: "mb_word_separator", file: !505, line: 551)
!863 = !DILabel(scope: !864, name: "word_separator", file: !505, line: 641)
!864 = distinct !DILexicalBlock(scope: !865, file: !505, line: 624, column: 17)
!865 = distinct !DILexicalBlock(scope: !861, file: !505, line: 622, column: 13)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!546, !29, !45, !869, !869}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !872, file: !505, line: 233, type: !887, isLocal: true, isDefinition: true)
!872 = distinct !DISubprogram(name: "write_counts", scope: !505, file: !505, line: 226, type: !873, scopeLine: 232, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !504, retainedNodes: !875)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !724, !724, !724, !724, !724, !29}
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883}
!876 = !DILocalVariable(name: "lines", arg: 1, scope: !872, file: !505, line: 226, type: !724)
!877 = !DILocalVariable(name: "words", arg: 2, scope: !872, file: !505, line: 227, type: !724)
!878 = !DILocalVariable(name: "chars", arg: 3, scope: !872, file: !505, line: 228, type: !724)
!879 = !DILocalVariable(name: "bytes", arg: 4, scope: !872, file: !505, line: 229, type: !724)
!880 = !DILocalVariable(name: "linelength", arg: 5, scope: !872, file: !505, line: 230, type: !724)
!881 = !DILocalVariable(name: "file", arg: 6, scope: !872, file: !505, line: 231, type: !29)
!882 = !DILocalVariable(name: "format_int", scope: !872, file: !505, line: 234, type: !29)
!883 = !DILocalVariable(name: "buf", scope: !872, file: !505, line: 235, type: !884)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 168, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 21)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 40, elements: !783)
!888 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!889 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!890 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!891 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!892 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!893 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!894 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!895 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!896 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!897 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!898 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "program_name", scope: !901, file: !902, line: 33, type: !29, isLocal: false, isDefinition: true)
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !903, globals: !904, splitDebugInlining: false, nameTableKind: None)
!902 = !DIFile(filename: "../lib/progname.c", directory: "/coreutils/obj-llvm")
!903 = !{!6, !7}
!904 = !{!899}
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !907, file: !908, line: 108, type: !926, isLocal: true, isDefinition: true)
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !909, retainedTypes: !915, globals: !916, splitDebugInlining: false, nameTableKind: None)
!908 = !DIFile(filename: "../lib/quotearg.c", directory: "/coreutils/obj-llvm")
!909 = !{!507, !910, !543}
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !508, line: 247, baseType: !62, size: 32, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!913 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!914 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!915 = !{!45, !94, !23, !29}
!916 = !{!917, !920, !924, !905, !936, !938, !945, !947}
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !907, file: !908, line: 77, type: !919, isLocal: false, isDefinition: true)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 704, elements: !771)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !907, file: !908, line: 93, type: !922, isLocal: false, isDefinition: true)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 320, elements: !298)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !907, file: !908, line: 1047, type: !926, isLocal: false, isDefinition: true)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !908, line: 57, size: 448, elements: !927)
!927 = !{!928, !929, !930, !934, !935}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !926, file: !908, line: 60, baseType: !507, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !926, file: !908, line: 63, baseType: !45, size: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !926, file: !908, line: 67, baseType: !931, size: 256, offset: 64)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 8)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !926, file: !908, line: 70, baseType: !29, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !926, file: !908, line: 73, baseType: !29, size: 64, offset: 384)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "slot0", scope: !907, file: !908, line: 837, type: !98, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "slotvec", scope: !907, file: !908, line: 840, type: !940, isLocal: true, isDefinition: true)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !908, line: 829, size: 128, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !941, file: !908, line: 831, baseType: !23, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !941, file: !908, line: 832, baseType: !7, size: 64, offset: 64)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "nslots", scope: !907, file: !908, line: 838, type: !45, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "slotvec0", scope: !907, file: !908, line: 839, type: !941, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !951, file: !952, line: 26, type: !954, isLocal: false, isDefinition: true)
!951 = distinct !DICompileUnit(language: DW_LANG_C99, file: !952, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !953, splitDebugInlining: false, nameTableKind: None)
!952 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/coreutils/obj-llvm")
!953 = !{!949}
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 47)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "posix", scope: !959, file: !214, line: 1093, type: !445, isLocal: true, isDefinition: true)
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !961, globals: !962, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "libc/misc/locale/newlocale.c", directory: "/tmp/klee-uclibc-130")
!961 = !{!62, !7, !6, !23, !211, !45}
!962 = !{!963, !957, !1121}
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "envstr", scope: !965, file: !214, line: 1269, type: !1120, isLocal: true, isDefinition: true)
