; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"

%struct.__uclibc_locale_struct.205 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.204 }
%struct.__collate_t.204 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.572 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.572*, [2 x i32], %struct.__mbstate_t.571, i8* }
%struct.__mbstate_t.571 = type { i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/tmp/klee-uclibc-130")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/tmp/klee-uclibc-130")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/tmp/klee-uclibc-130")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 313, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 312, type: !55, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!54 = !DIFile(filename: "klee_src/runtime/POSIX/fd.c", directory: "/tmp")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "clang version 13.0.1 (https://github.com/llvm/llvm-project.git 75e33f71c2dae584b13a7d1186ae0a038ba98838)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/tmp/klee_src/runtime/POSIX/fd.c", directory: "/tmp/klee_build130stp_z3/runtime/POSIX")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "klee_src/runtime/POSIX/fd.h", directory: "/tmp")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !149, !156, !162, !167, !172}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 345, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 344, type: !143, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !6, !147}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !148, line: 46, baseType: !10)
!148 = !DIFile(filename: "llvm-130-install_O_D_A/lib/clang/13.0.1/include/stddef.h", directory: "/tmp")
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "n_calls", scope: !151, file: !54, line: 411, type: !45, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 410, type: !152, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!145, !45, !154, !147}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "n_calls", scope: !158, file: !54, line: 647, type: !45, isLocal: true, isDefinition: true)
!158 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 646, type: !159, scopeLine: 646, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!159 = !DISubroutineType(types: !160)
!160 = !{!45, !29, !161}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "n_calls", scope: !164, file: !54, line: 666, type: !45, isLocal: true, isDefinition: true)
!164 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 665, type: !165, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!165 = !DISubroutineType(types: !166)
!166 = !{!45, !45, !161}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "n_calls", scope: !169, file: !54, line: 752, type: !45, isLocal: true, isDefinition: true)
!169 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 751, type: !170, scopeLine: 751, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!170 = !DISubroutineType(types: !171)
!171 = !{!45, !45, !82}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "n_calls", scope: !174, file: !54, line: 1346, type: !45, isLocal: true, isDefinition: true)
!174 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1345, type: !175, scopeLine: 1345, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!175 = !DISubroutineType(types: !176)
!176 = !{!7, !7, !147}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !179, file: !214, line: 375, type: !453, isLocal: false, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !181, retainedTypes: !203, globals: !256, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/tmp/klee-uclibc-130")
!181 = !{!182, !188}
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 90, baseType: !62, size: 32, elements: !184)
!183 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/tmp/klee-uclibc-130")
!184 = !{!185, !186, !187}
!185 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!186 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!187 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 48, baseType: !62, size: 32, elements: !190)
!189 = !DIFile(filename: "./include/ctype.h", directory: "/tmp/klee-uclibc-130")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!191 = !DIEnumerator(name: "_ISupper", value: 256)
!192 = !DIEnumerator(name: "_ISlower", value: 512)
!193 = !DIEnumerator(name: "_ISalpha", value: 1024)
!194 = !DIEnumerator(name: "_ISdigit", value: 2048)
!195 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!196 = !DIEnumerator(name: "_ISspace", value: 8192)
!197 = !DIEnumerator(name: "_ISprint", value: 16384)
!198 = !DIEnumerator(name: "_ISgraph", value: 32768)
!199 = !DIEnumerator(name: "_ISblank", value: 1)
!200 = !DIEnumerator(name: "_IScntrl", value: 2)
!201 = !DIEnumerator(name: "_ISpunct", value: 4)
!202 = !DIEnumerator(name: "_ISalnum", value: 8)
!203 = !{!45, !204, !7, !205, !207, !210, !96, !211, !212, !225, !233, !10}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!210 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !214, line: 400, baseType: !215)
!214 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/tmp/klee-uclibc-130")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 390, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !215, file: !214, line: 391, baseType: !209, size: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !215, file: !214, line: 392, baseType: !209, size: 16, offset: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !215, file: !214, line: 393, baseType: !209, size: 16, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !215, file: !214, line: 394, baseType: !209, size: 16, offset: 48)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !215, file: !214, line: 396, baseType: !209, size: 16, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !215, file: !214, line: 397, baseType: !209, size: 16, offset: 80)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !215, file: !214, line: 398, baseType: !209, size: 16, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !215, file: !214, line: 399, baseType: !209, size: 16, offset: 112)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !214, line: 430, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 425, size: 64, elements: !228)
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !227, file: !214, line: 426, baseType: !209, size: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !227, file: !214, line: 427, baseType: !209, size: 16, offset: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !227, file: !214, line: 428, baseType: !209, size: 16, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !227, file: !214, line: 429, baseType: !209, size: 16, offset: 48)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !214, line: 423, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 402, size: 304, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !235, file: !214, line: 403, baseType: !209, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !235, file: !214, line: 404, baseType: !209, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !235, file: !214, line: 405, baseType: !209, size: 16, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !235, file: !214, line: 406, baseType: !209, size: 16, offset: 48)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !235, file: !214, line: 407, baseType: !209, size: 16, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !235, file: !214, line: 408, baseType: !209, size: 16, offset: 80)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !235, file: !214, line: 409, baseType: !209, size: 16, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !235, file: !214, line: 410, baseType: !209, size: 16, offset: 112)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !235, file: !214, line: 411, baseType: !209, size: 16, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !235, file: !214, line: 412, baseType: !209, size: 16, offset: 144)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !235, file: !214, line: 413, baseType: !209, size: 16, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !235, file: !214, line: 414, baseType: !209, size: 16, offset: 176)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !235, file: !214, line: 415, baseType: !209, size: 16, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !235, file: !214, line: 416, baseType: !209, size: 16, offset: 208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !235, file: !214, line: 418, baseType: !209, size: 16, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !235, file: !214, line: 419, baseType: !209, size: 16, offset: 240)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !235, file: !214, line: 420, baseType: !209, size: 16, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !235, file: !214, line: 421, baseType: !209, size: 16, offset: 272)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !235, file: !214, line: 422, baseType: !209, size: 16, offset: 288)
!256 = !{!257, !441, !177, !443, !446, !448}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "__global_locale", scope: !179, file: !214, line: 377, type: !259, isLocal: false, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !183, line: 330, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !183, line: 154, size: 26560, elements: !262)
!262 = !{!263, !270, !276, !277, !281, !283, !284, !288, !292, !294, !295, !296, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !261, file: !183, line: 156, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !267, line: 38, baseType: !268)
!267 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/tmp/klee-uclibc-130")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !269, line: 44, baseType: !94)
!269 = !DIFile(filename: "./include/bits/types.h", directory: "/tmp/klee-uclibc-130")
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !261, file: !183, line: 157, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !267, line: 42, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !269, line: 43, baseType: !275)
!275 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !261, file: !183, line: 158, baseType: !271, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !261, file: !183, line: 162, baseType: !278, size: 6144, offset: 192)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 6144, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !261, file: !183, line: 163, baseType: !282, size: 6144, offset: 6336)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 6144, elements: !279)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !261, file: !183, line: 164, baseType: !282, size: 6144, offset: 12480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !261, file: !183, line: 168, baseType: !285, size: 112, offset: 18624)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 14)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !261, file: !183, line: 174, baseType: !289, size: 96, offset: 18736)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 6)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !261, file: !183, line: 175, baseType: !293, size: 48, offset: 18832)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !290)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !261, file: !183, line: 178, baseType: !96, size: 8, offset: 18880)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !261, file: !183, line: 179, baseType: !96, size: 8, offset: 18888)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !261, file: !183, line: 180, baseType: !297, size: 80, offset: 18896)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 80, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 10)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !261, file: !183, line: 183, baseType: !205, size: 64, offset: 19008)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !261, file: !183, line: 184, baseType: !205, size: 64, offset: 19072)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !261, file: !183, line: 185, baseType: !205, size: 64, offset: 19136)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !261, file: !183, line: 186, baseType: !205, size: 64, offset: 19200)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !261, file: !183, line: 188, baseType: !205, size: 64, offset: 19264)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !261, file: !183, line: 189, baseType: !207, size: 64, offset: 19328)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !261, file: !183, line: 190, baseType: !205, size: 64, offset: 19392)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !261, file: !183, line: 191, baseType: !205, size: 64, offset: 19456)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !261, file: !183, line: 197, baseType: !207, size: 64, offset: 19520)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !261, file: !183, line: 199, baseType: !205, size: 64, offset: 19584)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !261, file: !183, line: 200, baseType: !205, size: 64, offset: 19648)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !261, file: !183, line: 202, baseType: !312, size: 64, offset: 19712)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !275)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !261, file: !183, line: 205, baseType: !316, size: 32, offset: 19776)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !261, file: !183, line: 206, baseType: !316, size: 32, offset: 19808)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !261, file: !183, line: 207, baseType: !45, size: 32, offset: 19840)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !261, file: !183, line: 208, baseType: !45, size: 32, offset: 19872)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !261, file: !183, line: 213, baseType: !29, size: 64, offset: 19904)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !261, file: !183, line: 214, baseType: !29, size: 64, offset: 19968)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !261, file: !183, line: 215, baseType: !29, size: 64, offset: 20032)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !261, file: !183, line: 216, baseType: !29, size: 64, offset: 20096)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !261, file: !183, line: 217, baseType: !29, size: 64, offset: 20160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !261, file: !183, line: 218, baseType: !29, size: 64, offset: 20224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !261, file: !183, line: 219, baseType: !29, size: 64, offset: 20288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !261, file: !183, line: 220, baseType: !29, size: 64, offset: 20352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !261, file: !183, line: 221, baseType: !29, size: 64, offset: 20416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !261, file: !183, line: 222, baseType: !29, size: 64, offset: 20480)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !261, file: !183, line: 223, baseType: !29, size: 64, offset: 20544)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !261, file: !183, line: 226, baseType: !29, size: 64, offset: 20608)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !261, file: !183, line: 227, baseType: !29, size: 64, offset: 20672)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !261, file: !183, line: 228, baseType: !29, size: 64, offset: 20736)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !261, file: !183, line: 231, baseType: !29, size: 64, offset: 20800)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !261, file: !183, line: 232, baseType: !29, size: 64, offset: 20864)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !261, file: !183, line: 233, baseType: !29, size: 64, offset: 20928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !261, file: !183, line: 234, baseType: !29, size: 64, offset: 20992)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !261, file: !183, line: 235, baseType: !29, size: 64, offset: 21056)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !261, file: !183, line: 236, baseType: !29, size: 64, offset: 21120)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !261, file: !183, line: 237, baseType: !29, size: 64, offset: 21184)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !261, file: !183, line: 238, baseType: !29, size: 64, offset: 21248)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !261, file: !183, line: 239, baseType: !29, size: 64, offset: 21312)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !261, file: !183, line: 240, baseType: !29, size: 64, offset: 21376)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !261, file: !183, line: 241, baseType: !29, size: 64, offset: 21440)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !261, file: !183, line: 242, baseType: !29, size: 64, offset: 21504)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !261, file: !183, line: 243, baseType: !29, size: 64, offset: 21568)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !261, file: !183, line: 244, baseType: !29, size: 64, offset: 21632)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !261, file: !183, line: 245, baseType: !29, size: 64, offset: 21696)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !261, file: !183, line: 246, baseType: !29, size: 64, offset: 21760)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !261, file: !183, line: 247, baseType: !29, size: 64, offset: 21824)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !261, file: !183, line: 248, baseType: !29, size: 64, offset: 21888)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !261, file: !183, line: 249, baseType: !29, size: 64, offset: 21952)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !261, file: !183, line: 250, baseType: !29, size: 64, offset: 22016)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !261, file: !183, line: 251, baseType: !29, size: 64, offset: 22080)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !261, file: !183, line: 253, baseType: !29, size: 64, offset: 22144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !261, file: !183, line: 256, baseType: !29, size: 64, offset: 22208)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !261, file: !183, line: 257, baseType: !29, size: 64, offset: 22272)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !261, file: !183, line: 258, baseType: !29, size: 64, offset: 22336)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !261, file: !183, line: 259, baseType: !29, size: 64, offset: 22400)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !261, file: !183, line: 260, baseType: !29, size: 64, offset: 22464)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !261, file: !183, line: 261, baseType: !29, size: 64, offset: 22528)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !261, file: !183, line: 262, baseType: !29, size: 64, offset: 22592)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !261, file: !183, line: 264, baseType: !29, size: 64, offset: 22656)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !261, file: !183, line: 265, baseType: !29, size: 64, offset: 22720)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !261, file: !183, line: 266, baseType: !29, size: 64, offset: 22784)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !261, file: !183, line: 267, baseType: !29, size: 64, offset: 22848)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !261, file: !183, line: 268, baseType: !29, size: 64, offset: 22912)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !261, file: !183, line: 269, baseType: !29, size: 64, offset: 22976)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !261, file: !183, line: 270, baseType: !29, size: 64, offset: 23040)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !261, file: !183, line: 272, baseType: !29, size: 64, offset: 23104)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !261, file: !183, line: 273, baseType: !29, size: 64, offset: 23168)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !261, file: !183, line: 274, baseType: !29, size: 64, offset: 23232)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !261, file: !183, line: 275, baseType: !29, size: 64, offset: 23296)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !261, file: !183, line: 276, baseType: !29, size: 64, offset: 23360)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !261, file: !183, line: 277, baseType: !29, size: 64, offset: 23424)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !261, file: !183, line: 278, baseType: !29, size: 64, offset: 23488)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !261, file: !183, line: 279, baseType: !29, size: 64, offset: 23552)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !261, file: !183, line: 280, baseType: !29, size: 64, offset: 23616)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !261, file: !183, line: 281, baseType: !29, size: 64, offset: 23680)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !261, file: !183, line: 282, baseType: !29, size: 64, offset: 23744)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !261, file: !183, line: 283, baseType: !29, size: 64, offset: 23808)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !261, file: !183, line: 285, baseType: !29, size: 64, offset: 23872)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !261, file: !183, line: 286, baseType: !29, size: 64, offset: 23936)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !261, file: !183, line: 287, baseType: !29, size: 64, offset: 24000)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !261, file: !183, line: 288, baseType: !29, size: 64, offset: 24064)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !261, file: !183, line: 289, baseType: !29, size: 64, offset: 24128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !261, file: !183, line: 290, baseType: !29, size: 64, offset: 24192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !261, file: !183, line: 291, baseType: !29, size: 64, offset: 24256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !261, file: !183, line: 292, baseType: !29, size: 64, offset: 24320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !261, file: !183, line: 293, baseType: !29, size: 64, offset: 24384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !261, file: !183, line: 294, baseType: !29, size: 64, offset: 24448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !261, file: !183, line: 295, baseType: !29, size: 64, offset: 24512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !261, file: !183, line: 296, baseType: !29, size: 64, offset: 24576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !261, file: !183, line: 298, baseType: !29, size: 64, offset: 24640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !261, file: !183, line: 299, baseType: !29, size: 64, offset: 24704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !261, file: !183, line: 301, baseType: !29, size: 64, offset: 24768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !261, file: !183, line: 302, baseType: !29, size: 64, offset: 24832)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !261, file: !183, line: 303, baseType: !29, size: 64, offset: 24896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !261, file: !183, line: 304, baseType: !29, size: 64, offset: 24960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !261, file: !183, line: 305, baseType: !29, size: 64, offset: 25024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !261, file: !183, line: 307, baseType: !29, size: 64, offset: 25088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !261, file: !183, line: 308, baseType: !29, size: 64, offset: 25152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !261, file: !183, line: 309, baseType: !29, size: 64, offset: 25216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !261, file: !183, line: 310, baseType: !29, size: 64, offset: 25280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !261, file: !183, line: 311, baseType: !29, size: 64, offset: 25344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !261, file: !183, line: 316, baseType: !29, size: 64, offset: 25408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !261, file: !183, line: 317, baseType: !29, size: 64, offset: 25472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !261, file: !183, line: 318, baseType: !29, size: 64, offset: 25536)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !261, file: !183, line: 319, baseType: !29, size: 64, offset: 25600)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !261, file: !183, line: 322, baseType: !411, size: 896, offset: 25664)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !183, line: 149, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 111, size: 896, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !439, !440}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !412, file: !183, line: 112, baseType: !209, size: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !412, file: !183, line: 113, baseType: !209, size: 16, offset: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !412, file: !183, line: 114, baseType: !209, size: 16, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !412, file: !183, line: 115, baseType: !209, size: 16, offset: 48)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !412, file: !183, line: 116, baseType: !209, size: 16, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !412, file: !183, line: 117, baseType: !209, size: 16, offset: 80)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !412, file: !183, line: 118, baseType: !209, size: 16, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !412, file: !183, line: 119, baseType: !209, size: 16, offset: 112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !412, file: !183, line: 120, baseType: !209, size: 16, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !412, file: !183, line: 121, baseType: !209, size: 16, offset: 144)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !412, file: !183, line: 122, baseType: !209, size: 16, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !412, file: !183, line: 123, baseType: !209, size: 16, offset: 176)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !412, file: !183, line: 124, baseType: !209, size: 16, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !412, file: !183, line: 125, baseType: !209, size: 16, offset: 208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !412, file: !183, line: 127, baseType: !209, size: 16, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !412, file: !183, line: 128, baseType: !209, size: 16, offset: 240)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !412, file: !183, line: 130, baseType: !207, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !412, file: !183, line: 131, baseType: !207, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !412, file: !183, line: 132, baseType: !207, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !412, file: !183, line: 135, baseType: !207, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !412, file: !183, line: 138, baseType: !207, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !412, file: !183, line: 141, baseType: !207, size: 64, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !412, file: !183, line: 142, baseType: !207, size: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !412, file: !183, line: 145, baseType: !438, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !412, file: !183, line: 146, baseType: !438, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !412, file: !183, line: 148, baseType: !209, size: 16, offset: 832)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !179, file: !214, line: 380, type: !259, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "utf8", scope: !179, file: !214, line: 387, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !290)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "ascii", scope: !179, file: !214, line: 388, type: !445, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "__code2flag", scope: !179, file: !214, line: 854, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 256, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 16)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !183, line: 324, baseType: !261)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !456, file: !457, line: 131, type: !501, isLocal: true, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/tmp/klee-uclibc-130")
!458 = !{!459, !491, !493, !495, !497, !499, !454}
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "stdin", scope: !456, file: !457, line: 154, type: !461, isLocal: false, isDefinition: true)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !463, line: 46, baseType: !464)
!463 = !DIFile(filename: "./include/stdio.h", directory: "/tmp/klee-uclibc-130")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !465, line: 233, size: 704, elements: !466)
!465 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/tmp/klee-uclibc-130")
!466 = !{!467, !468, !472, !473, !474, !475, !476, !477, !478, !479, !481, !483, !490}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !464, file: !465, line: 234, baseType: !94, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !464, file: !465, line: 237, baseType: !469, size: 16, offset: 16)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 2)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !464, file: !465, line: 244, baseType: !45, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !464, file: !465, line: 246, baseType: !211, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !464, file: !465, line: 247, baseType: !211, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !464, file: !465, line: 248, baseType: !211, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !464, file: !465, line: 249, baseType: !211, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !464, file: !465, line: 252, baseType: !211, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !464, file: !465, line: 255, baseType: !211, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !464, file: !465, line: 261, baseType: !480, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !464, file: !465, line: 268, baseType: !482, size: 64, offset: 512)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 64, elements: !470)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !464, file: !465, line: 271, baseType: !484, size: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !485, line: 85, baseType: !486)
!485 = !DIFile(filename: "./include/wchar.h", directory: "/tmp/klee-uclibc-130")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 81, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !486, file: !485, line: 83, baseType: !316, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !486, file: !485, line: 84, baseType: !316, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !464, file: !465, line: 274, baseType: !6, size: 64, offset: 640)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stdout", scope: !456, file: !457, line: 155, type: !461, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "stderr", scope: !456, file: !457, line: 156, type: !461, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdin", scope: !456, file: !457, line: 159, type: !461, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "__stdout", scope: !456, file: !457, line: 162, type: !461, isLocal: false, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !456, file: !457, line: 180, type: !461, isLocal: false, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 2112, elements: !137)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "long_options", scope: !504, file: !505, line: 81, type: !686, isLocal: true, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !506, retainedTypes: !617, globals: !618, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "../src/dircolors.c", directory: "/coreutils/obj-llvm")
!506 = !{!507, !512, !601, !615}
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Shell_syntax", file: !505, line: 39, baseType: !62, size: 32, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIEnumerator(name: "SHELL_SYNTAX_BOURNE", value: 0)
!510 = !DIEnumerator(name: "SHELL_SYNTAX_C", value: 1)
!511 = !DIEnumerator(name: "SHELL_SYNTAX_UNKNOWN", value: 2)
!512 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !513, file: !505, line: 277, baseType: !62, size: 32, elements: !596)
!513 = distinct !DISubprogram(name: "dc_parse_stream", scope: !505, file: !505, line: 265, type: !514, scopeLine: 266, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !504, retainedNodes: !567)
!514 = !DISubroutineType(types: !515)
!515 = !{!516, !517, !29}
!516 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !519, line: 7, baseType: !520)
!519 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !521, line: 49, size: 1728, elements: !522)
!521 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !538, !540, !541, !542, !543, !544, !545, !549, !552, !553, !556, !559, !560, !561, !562, !563}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !520, file: !521, line: 51, baseType: !45, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !520, file: !521, line: 54, baseType: !7, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !520, file: !521, line: 55, baseType: !7, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !520, file: !521, line: 56, baseType: !7, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !520, file: !521, line: 57, baseType: !7, size: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !520, file: !521, line: 58, baseType: !7, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !520, file: !521, line: 59, baseType: !7, size: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !520, file: !521, line: 60, baseType: !7, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !520, file: !521, line: 61, baseType: !7, size: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !520, file: !521, line: 64, baseType: !7, size: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !520, file: !521, line: 65, baseType: !7, size: 64, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !520, file: !521, line: 66, baseType: !7, size: 64, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !520, file: !521, line: 68, baseType: !536, size: 64, offset: 768)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !521, line: 36, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !520, file: !521, line: 70, baseType: !539, size: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !520, file: !521, line: 72, baseType: !45, size: 32, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !520, file: !521, line: 73, baseType: !45, size: 32, offset: 928)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !520, file: !521, line: 74, baseType: !120, size: 64, offset: 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !520, file: !521, line: 77, baseType: !94, size: 16, offset: 1024)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !520, file: !521, line: 78, baseType: !210, size: 8, offset: 1040)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !520, file: !521, line: 79, baseType: !546, size: 8, offset: 1048)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 1)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !520, file: !521, line: 81, baseType: !550, size: 64, offset: 1088)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !521, line: 43, baseType: null)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !520, file: !521, line: 89, baseType: !84, size: 64, offset: 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !520, file: !521, line: 91, baseType: !554, size: 64, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !521, line: 37, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !520, file: !521, line: 92, baseType: !557, size: 64, offset: 1280)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !521, line: 38, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !520, file: !521, line: 93, baseType: !539, size: 64, offset: 1344)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !520, file: !521, line: 94, baseType: !6, size: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !520, file: !521, line: 95, baseType: !23, size: 64, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !520, file: !521, line: 96, baseType: !45, size: 32, offset: 1536)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !520, file: !521, line: 98, baseType: !564, size: 160, offset: 1568)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 20)
!567 = !{!568, !569, !570, !574, !575, !576, !577, !578, !579, !580, !581, !582, !584, !585, !586}
!568 = !DILocalVariable(name: "fp", arg: 1, scope: !513, file: !505, line: 265, type: !517)
!569 = !DILocalVariable(name: "filename", arg: 2, scope: !513, file: !505, line: 265, type: !29)
!570 = !DILocalVariable(name: "line_number", scope: !513, file: !505, line: 267, type: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !572, line: 125, baseType: !573)
!572 = !DIFile(filename: "../lib/idx.h", directory: "/coreutils/obj-llvm")
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !24, line: 35, baseType: !81)
!574 = !DILocalVariable(name: "next_G_line", scope: !513, file: !505, line: 268, type: !29)
!575 = !DILocalVariable(name: "input_line", scope: !513, file: !505, line: 269, type: !7)
!576 = !DILocalVariable(name: "input_line_size", scope: !513, file: !505, line: 270, type: !23)
!577 = !DILocalVariable(name: "line", scope: !513, file: !505, line: 271, type: !29)
!578 = !DILocalVariable(name: "term", scope: !513, file: !505, line: 272, type: !29)
!579 = !DILocalVariable(name: "colorterm", scope: !513, file: !505, line: 273, type: !29)
!580 = !DILocalVariable(name: "ok", scope: !513, file: !505, line: 274, type: !516)
!581 = !DILocalVariable(name: "state", scope: !513, file: !505, line: 277, type: !512)
!582 = !DILocalVariable(name: "keywd", scope: !583, file: !505, line: 291, type: !7)
!583 = distinct !DILexicalBlock(scope: !513, file: !505, line: 290, column: 5)
!584 = !DILocalVariable(name: "arg", scope: !583, file: !505, line: 291, type: !7)
!585 = !DILocalVariable(name: "unrecognized", scope: !583, file: !505, line: 292, type: !516)
!586 = !DILocalVariable(name: "i", scope: !587, file: !505, line: 362, type: !45)
!587 = distinct !DILexicalBlock(scope: !588, file: !505, line: 361, column: 17)
!588 = distinct !DILexicalBlock(scope: !589, file: !505, line: 354, column: 24)
!589 = distinct !DILexicalBlock(scope: !590, file: !505, line: 352, column: 24)
!590 = distinct !DILexicalBlock(scope: !591, file: !505, line: 350, column: 19)
!591 = distinct !DILexicalBlock(scope: !592, file: !505, line: 349, column: 13)
!592 = distinct !DILexicalBlock(scope: !593, file: !505, line: 348, column: 15)
!593 = distinct !DILexicalBlock(scope: !594, file: !505, line: 344, column: 9)
!594 = distinct !DILexicalBlock(scope: !595, file: !505, line: 338, column: 16)
!595 = distinct !DILexicalBlock(scope: !583, file: !505, line: 333, column: 11)
!596 = !{!597, !598, !599, !600}
!597 = !DIEnumerator(name: "ST_TERMNO", value: 0)
!598 = !DIEnumerator(name: "ST_TERMYES", value: 1)
!599 = !DIEnumerator(name: "ST_TERMSURE", value: 2)
!600 = !DIEnumerator(name: "ST_GLOBAL", value: 3)
!601 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !602, line: 37, baseType: !62, size: 32, elements: !603)
!602 = !DIFile(filename: "../lib/quotearg.h", directory: "/coreutils/obj-llvm")
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!604 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!605 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!606 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!607 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!608 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!609 = !DIEnumerator(name: "c_quoting_style", value: 5)
!610 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!611 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!612 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!613 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!614 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !616, line: 46, baseType: !62, size: 32, elements: !190)
!616 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!617 = !{!29, !7, !6, !23, !45, !94}
!618 = !{!619, !670, !502, !672, !678, !684}
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "lsc_obstack", scope: !504, file: !505, line: 50, type: !621, isLocal: true, isDefinition: true)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !622, line: 178, size: 704, elements: !623)
!622 = !DIFile(filename: "../lib/obstack.h", directory: "/coreutils/obj-llvm")
!623 = !{!624, !625, !635, !636, !637, !638, !643, !644, !655, !666, !667, !668, !669}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !621, file: !622, line: 180, baseType: !23, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !621, file: !622, line: 181, baseType: !626, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !622, line: 171, size: 128, elements: !628)
!628 = !{!629, !630, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !627, file: !622, line: 173, baseType: !7, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !627, file: !622, line: 174, baseType: !626, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !627, file: !622, line: 175, baseType: !632, offset: 128)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: -1)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !621, file: !622, line: 182, baseType: !7, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !621, file: !622, line: 183, baseType: !7, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !621, file: !622, line: 184, baseType: !7, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !621, file: !622, line: 189, baseType: !639, size: 64, offset: 320)
!639 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 185, size: 64, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !639, file: !622, line: 187, baseType: !23, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !639, file: !622, line: 188, baseType: !6, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !621, file: !622, line: 190, baseType: !23, size: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !621, file: !622, line: 197, baseType: !645, size: 64, offset: 448)
!645 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 193, size: 64, elements: !646)
!646 = !{!647, !651}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !645, file: !622, line: 195, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!6, !23}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !645, file: !622, line: 196, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!6, !6, !23}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !621, file: !622, line: 202, baseType: !656, size: 64, offset: 512)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 198, size: 64, elements: !657)
!657 = !{!658, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !656, file: !622, line: 200, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !6}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !656, file: !622, line: 201, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !6, !6}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !621, file: !622, line: 204, baseType: !6, size: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !621, file: !622, line: 205, baseType: !62, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !621, file: !622, line: 206, baseType: !62, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !621, file: !622, line: 210, baseType: !62, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "print_ls_colors", scope: !504, file: !505, line: 72, type: !516, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "G_line", scope: !504, file: !674, line: 1, type: !675, isLocal: true, isDefinition: true)
!674 = !DIFile(filename: "../src/dircolors.h", directory: "/coreutils/obj-llvm")
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 43848, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 5481)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "slack_codes", scope: !504, file: !505, line: 52, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 2432, elements: !682)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!682 = !{!683}
!683 = !DISubrange(count: 38)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "ls_codes", scope: !504, file: !505, line: 62, type: !680, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 2304, elements: !696)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !689, line: 50, size: 256, elements: !690)
!689 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!690 = !{!691, !692, !693, !695}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !688, file: !689, line: 52, baseType: !29, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !688, file: !689, line: 55, baseType: !45, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !688, file: !689, line: 56, baseType: !694, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !688, file: !689, line: 57, baseType: !45, size: 32, offset: 192)
!696 = !{!697}
!697 = !DISubrange(count: 9)
!698 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "program_name", scope: !701, file: !702, line: 33, type: !29, isLocal: false, isDefinition: true)
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !703, globals: !704, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "../lib/progname.c", directory: "/coreutils/obj-llvm")
!703 = !{!6, !7}
!704 = !{!699}
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !707, file: !708, line: 108, type: !728, isLocal: true, isDefinition: true)
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !709, retainedTypes: !715, globals: !716, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "../lib/quotearg.c", directory: "/coreutils/obj-llvm")
!709 = !{!601, !710, !615}
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !602, line: 247, baseType: !62, size: 32, elements: !711)
!711 = !{!712, !713, !714}
!712 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!713 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!714 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!715 = !{!45, !94, !23, !29}
!716 = !{!717, !722, !726, !705, !738, !740, !747, !749}
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !707, file: !708, line: 77, type: !719, isLocal: false, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 704, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 11)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !707, file: !708, line: 93, type: !724, isLocal: false, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 320, elements: !298)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !707, file: !708, line: 1047, type: !728, isLocal: false, isDefinition: true)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !708, line: 57, size: 448, elements: !729)
!729 = !{!730, !731, !732, !736, !737}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !728, file: !708, line: 60, baseType: !601, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !728, file: !708, line: 63, baseType: !45, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !728, file: !708, line: 67, baseType: !733, size: 256, offset: 64)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 8)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !728, file: !708, line: 70, baseType: !29, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !728, file: !708, line: 73, baseType: !29, size: 64, offset: 384)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "slot0", scope: !707, file: !708, line: 837, type: !98, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "slotvec", scope: !707, file: !708, line: 840, type: !742, isLocal: true, isDefinition: true)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !708, line: 829, size: 128, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !743, file: !708, line: 831, baseType: !23, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !743, file: !708, line: 832, baseType: !7, size: 64, offset: 64)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "nslots", scope: !707, file: !708, line: 838, type: !45, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "slotvec0", scope: !707, file: !708, line: 839, type: !743, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !753, file: !754, line: 26, type: !756, isLocal: false, isDefinition: true)
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !755, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/coreutils/obj-llvm")
!755 = !{!751}
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 47)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "exit_failure", scope: !761, file: !762, line: 24, type: !764, isLocal: false, isDefinition: true)
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !763, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "../lib/exitfail.c", directory: "/coreutils/obj-llvm")
!763 = !{!759}
!764 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "internal_state", scope: !767, file: !768, line: 93, type: !771, isLocal: true, isDefinition: true)
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !769, globals: !770, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "../lib/mbrtoc32.c", directory: "/coreutils/obj-llvm")
!769 = !{!6, !23, !96}
!770 = !{!765}
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !772, line: 6, baseType: !773)
!772 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !774, line: 21, baseType: !775)
!774 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !774, line: 13, size: 64, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !775, file: !774, line: 15, baseType: !45, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !775, file: !774, line: 20, baseType: !779, size: 32, offset: 32)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !774, line: 16, size: 32, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !779, file: !774, line: 18, baseType: !62, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !779, file: !774, line: 19, baseType: !783, size: 32)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 4)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "posix", scope: !788, file: !214, line: 1093, type: !445, isLocal: true, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !790, globals: !791, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "libc/misc/locale/newlocale.c", directory: "/tmp/klee-uclibc-130")
!790 = !{!62, !7, !6, !23, !211, !45}
!791 = !{!792, !786, !950}
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "envstr", scope: !794, file: !214, line: 1269, type: !949, isLocal: true, isDefinition: true)
!794 = distinct !DISubprogram(name: "newlocale", scope: !214, file: !214, line: 1243, type: !795, scopeLine: 1244, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !788, retainedNodes: !4)
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !45, !29, !797}
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !183, line: 330, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !183, line: 154, size: 26560, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !799, file: !183, line: 156, baseType: !264, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !799, file: !183, line: 157, baseType: !271, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !799, file: !183, line: 158, baseType: !271, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !799, file: !183, line: 162, baseType: !278, size: 6144, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !799, file: !183, line: 163, baseType: !282, size: 6144, offset: 6336)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !799, file: !183, line: 164, baseType: !282, size: 6144, offset: 12480)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !799, file: !183, line: 168, baseType: !285, size: 112, offset: 18624)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !799, file: !183, line: 174, baseType: !289, size: 96, offset: 18736)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !799, file: !183, line: 175, baseType: !293, size: 48, offset: 18832)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !799, file: !183, line: 178, baseType: !96, size: 8, offset: 18880)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !799, file: !183, line: 179, baseType: !96, size: 8, offset: 18888)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !799, file: !183, line: 180, baseType: !297, size: 80, offset: 18896)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !799, file: !183, line: 183, baseType: !205, size: 64, offset: 19008)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !799, file: !183, line: 184, baseType: !205, size: 64, offset: 19072)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !799, file: !183, line: 185, baseType: !205, size: 64, offset: 19136)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !799, file: !183, line: 186, baseType: !205, size: 64, offset: 19200)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !799, file: !183, line: 188, baseType: !205, size: 64, offset: 19264)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !799, file: !183, line: 189, baseType: !207, size: 64, offset: 19328)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !799, file: !183, line: 190, baseType: !205, size: 64, offset: 19392)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !799, file: !183, line: 191, baseType: !205, size: 64, offset: 19456)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !799, file: !183, line: 197, baseType: !207, size: 64, offset: 19520)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !799, file: !183, line: 199, baseType: !205, size: 64, offset: 19584)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !799, file: !183, line: 200, baseType: !205, size: 64, offset: 19648)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !799, file: !183, line: 202, baseType: !312, size: 64, offset: 19712)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !799, file: !183, line: 205, baseType: !316, size: 32, offset: 19776)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !799, file: !183, line: 206, baseType: !316, size: 32, offset: 19808)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !799, file: !183, line: 207, baseType: !45, size: 32, offset: 19840)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !799, file: !183, line: 208, baseType: !45, size: 32, offset: 19872)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !799, file: !183, line: 213, baseType: !29, size: 64, offset: 19904)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !799, file: !183, line: 214, baseType: !29, size: 64, offset: 19968)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !799, file: !183, line: 215, baseType: !29, size: 64, offset: 20032)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !799, file: !183, line: 216, baseType: !29, size: 64, offset: 20096)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !799, file: !183, line: 217, baseType: !29, size: 64, offset: 20160)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !799, file: !183, line: 218, baseType: !29, size: 64, offset: 20224)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !799, file: !183, line: 219, baseType: !29, size: 64, offset: 20288)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !799, file: !183, line: 220, baseType: !29, size: 64, offset: 20352)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !799, file: !183, line: 221, baseType: !29, size: 64, offset: 20416)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !799, file: !183, line: 222, baseType: !29, size: 64, offset: 20480)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !799, file: !183, line: 223, baseType: !29, size: 64, offset: 20544)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !799, file: !183, line: 226, baseType: !29, size: 64, offset: 20608)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !799, file: !183, line: 227, baseType: !29, size: 64, offset: 20672)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !799, file: !183, line: 228, baseType: !29, size: 64, offset: 20736)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !799, file: !183, line: 231, baseType: !29, size: 64, offset: 20800)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !799, file: !183, line: 232, baseType: !29, size: 64, offset: 20864)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !799, file: !183, line: 233, baseType: !29, size: 64, offset: 20928)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !799, file: !183, line: 234, baseType: !29, size: 64, offset: 20992)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !799, file: !183, line: 235, baseType: !29, size: 64, offset: 21056)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !799, file: !183, line: 236, baseType: !29, size: 64, offset: 21120)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !799, file: !183, line: 237, baseType: !29, size: 64, offset: 21184)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !799, file: !183, line: 238, baseType: !29, size: 64, offset: 21248)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !799, file: !183, line: 239, baseType: !29, size: 64, offset: 21312)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !799, file: !183, line: 240, baseType: !29, size: 64, offset: 21376)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !799, file: !183, line: 241, baseType: !29, size: 64, offset: 21440)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !799, file: !183, line: 242, baseType: !29, size: 64, offset: 21504)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !799, file: !183, line: 243, baseType: !29, size: 64, offset: 21568)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !799, file: !183, line: 244, baseType: !29, size: 64, offset: 21632)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !799, file: !183, line: 245, baseType: !29, size: 64, offset: 21696)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !799, file: !183, line: 246, baseType: !29, size: 64, offset: 21760)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !799, file: !183, line: 247, baseType: !29, size: 64, offset: 21824)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !799, file: !183, line: 248, baseType: !29, size: 64, offset: 21888)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !799, file: !183, line: 249, baseType: !29, size: 64, offset: 21952)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !799, file: !183, line: 250, baseType: !29, size: 64, offset: 22016)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !799, file: !183, line: 251, baseType: !29, size: 64, offset: 22080)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !799, file: !183, line: 253, baseType: !29, size: 64, offset: 22144)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !799, file: !183, line: 256, baseType: !29, size: 64, offset: 22208)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !799, file: !183, line: 257, baseType: !29, size: 64, offset: 22272)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !799, file: !183, line: 258, baseType: !29, size: 64, offset: 22336)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !799, file: !183, line: 259, baseType: !29, size: 64, offset: 22400)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !799, file: !183, line: 260, baseType: !29, size: 64, offset: 22464)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !799, file: !183, line: 261, baseType: !29, size: 64, offset: 22528)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !799, file: !183, line: 262, baseType: !29, size: 64, offset: 22592)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !799, file: !183, line: 264, baseType: !29, size: 64, offset: 22656)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !799, file: !183, line: 265, baseType: !29, size: 64, offset: 22720)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !799, file: !183, line: 266, baseType: !29, size: 64, offset: 22784)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !799, file: !183, line: 267, baseType: !29, size: 64, offset: 22848)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !799, file: !183, line: 268, baseType: !29, size: 64, offset: 22912)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !799, file: !183, line: 269, baseType: !29, size: 64, offset: 22976)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !799, file: !183, line: 270, baseType: !29, size: 64, offset: 23040)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !799, file: !183, line: 272, baseType: !29, size: 64, offset: 23104)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !799, file: !183, line: 273, baseType: !29, size: 64, offset: 23168)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !799, file: !183, line: 274, baseType: !29, size: 64, offset: 23232)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !799, file: !183, line: 275, baseType: !29, size: 64, offset: 23296)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !799, file: !183, line: 276, baseType: !29, size: 64, offset: 23360)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !799, file: !183, line: 277, baseType: !29, size: 64, offset: 23424)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !799, file: !183, line: 278, baseType: !29, size: 64, offset: 23488)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !799, file: !183, line: 279, baseType: !29, size: 64, offset: 23552)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !799, file: !183, line: 280, baseType: !29, size: 64, offset: 23616)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !799, file: !183, line: 281, baseType: !29, size: 64, offset: 23680)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !799, file: !183, line: 282, baseType: !29, size: 64, offset: 23744)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !799, file: !183, line: 283, baseType: !29, size: 64, offset: 23808)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !799, file: !183, line: 285, baseType: !29, size: 64, offset: 23872)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !799, file: !183, line: 286, baseType: !29, size: 64, offset: 23936)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !799, file: !183, line: 287, baseType: !29, size: 64, offset: 24000)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !799, file: !183, line: 288, baseType: !29, size: 64, offset: 24064)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !799, file: !183, line: 289, baseType: !29, size: 64, offset: 24128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !799, file: !183, line: 290, baseType: !29, size: 64, offset: 24192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !799, file: !183, line: 291, baseType: !29, size: 64, offset: 24256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !799, file: !183, line: 292, baseType: !29, size: 64, offset: 24320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !799, file: !183, line: 293, baseType: !29, size: 64, offset: 24384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !799, file: !183, line: 294, baseType: !29, size: 64, offset: 24448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !799, file: !183, line: 295, baseType: !29, size: 64, offset: 24512)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !799, file: !183, line: 296, baseType: !29, size: 64, offset: 24576)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !799, file: !183, line: 298, baseType: !29, size: 64, offset: 24640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !799, file: !183, line: 299, baseType: !29, size: 64, offset: 24704)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !799, file: !183, line: 301, baseType: !29, size: 64, offset: 24768)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !799, file: !183, line: 302, baseType: !29, size: 64, offset: 24832)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !799, file: !183, line: 303, baseType: !29, size: 64, offset: 24896)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !799, file: !183, line: 304, baseType: !29, size: 64, offset: 24960)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !799, file: !183, line: 305, baseType: !29, size: 64, offset: 25024)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !799, file: !183, line: 307, baseType: !29, size: 64, offset: 25088)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !799, file: !183, line: 308, baseType: !29, size: 64, offset: 25152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !799, file: !183, line: 309, baseType: !29, size: 64, offset: 25216)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !799, file: !183, line: 310, baseType: !29, size: 64, offset: 25280)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !799, file: !183, line: 311, baseType: !29, size: 64, offset: 25344)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !799, file: !183, line: 316, baseType: !29, size: 64, offset: 25408)
