; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"

%struct.__uclibc_locale_struct.203 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.202 }
%struct.__collate_t.202 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.570 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.570*, [2 x i32], %struct.__mbstate_t.569, i8* }
%struct.__mbstate_t.569 = type { i32, i32 }
%struct.infomap = type { i8*, i8* }
%struct.slotvec = type { i64, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/tmp/klee-uclibc-130")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/tmp/klee-uclibc-130")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/tmp/klee-uclibc-130")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 313, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 312, type: !55, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!54 = !DIFile(filename: "klee_src/runtime/POSIX/fd.c", directory: "/tmp")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "clang version 13.0.1 (https://github.com/llvm/llvm-project.git 75e33f71c2dae584b13a7d1186ae0a038ba98838)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/tmp/klee_src/runtime/POSIX/fd.c", directory: "/tmp/klee_build130stp_z3/runtime/POSIX")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "klee_src/runtime/POSIX/fd.h", directory: "/tmp")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !149, !156, !162, !167, !172}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 345, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 344, type: !143, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !6, !147}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !148, line: 46, baseType: !10)
!148 = !DIFile(filename: "llvm-130-install_O_D_A/lib/clang/13.0.1/include/stddef.h", directory: "/tmp")
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "n_calls", scope: !151, file: !54, line: 411, type: !45, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 410, type: !152, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!145, !45, !154, !147}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "n_calls", scope: !158, file: !54, line: 647, type: !45, isLocal: true, isDefinition: true)
!158 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 646, type: !159, scopeLine: 646, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!159 = !DISubroutineType(types: !160)
!160 = !{!45, !29, !161}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "n_calls", scope: !164, file: !54, line: 666, type: !45, isLocal: true, isDefinition: true)
!164 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 665, type: !165, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!165 = !DISubroutineType(types: !166)
!166 = !{!45, !45, !161}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "n_calls", scope: !169, file: !54, line: 752, type: !45, isLocal: true, isDefinition: true)
!169 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 751, type: !170, scopeLine: 751, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!170 = !DISubroutineType(types: !171)
!171 = !{!45, !45, !82}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "n_calls", scope: !174, file: !54, line: 1346, type: !45, isLocal: true, isDefinition: true)
!174 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1345, type: !175, scopeLine: 1345, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!175 = !DISubroutineType(types: !176)
!176 = !{!7, !7, !147}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !179, file: !214, line: 375, type: !453, isLocal: false, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !181, retainedTypes: !203, globals: !256, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/tmp/klee-uclibc-130")
!181 = !{!182, !188}
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 90, baseType: !62, size: 32, elements: !184)
!183 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/tmp/klee-uclibc-130")
!184 = !{!185, !186, !187}
!185 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!186 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!187 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 48, baseType: !62, size: 32, elements: !190)
!189 = !DIFile(filename: "./include/ctype.h", directory: "/tmp/klee-uclibc-130")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!191 = !DIEnumerator(name: "_ISupper", value: 256)
!192 = !DIEnumerator(name: "_ISlower", value: 512)
!193 = !DIEnumerator(name: "_ISalpha", value: 1024)
!194 = !DIEnumerator(name: "_ISdigit", value: 2048)
!195 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!196 = !DIEnumerator(name: "_ISspace", value: 8192)
!197 = !DIEnumerator(name: "_ISprint", value: 16384)
!198 = !DIEnumerator(name: "_ISgraph", value: 32768)
!199 = !DIEnumerator(name: "_ISblank", value: 1)
!200 = !DIEnumerator(name: "_IScntrl", value: 2)
!201 = !DIEnumerator(name: "_ISpunct", value: 4)
!202 = !DIEnumerator(name: "_ISalnum", value: 8)
!203 = !{!45, !204, !7, !205, !207, !210, !96, !211, !212, !225, !233, !10}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!210 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !214, line: 400, baseType: !215)
!214 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/tmp/klee-uclibc-130")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 390, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !215, file: !214, line: 391, baseType: !209, size: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !215, file: !214, line: 392, baseType: !209, size: 16, offset: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !215, file: !214, line: 393, baseType: !209, size: 16, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !215, file: !214, line: 394, baseType: !209, size: 16, offset: 48)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !215, file: !214, line: 396, baseType: !209, size: 16, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !215, file: !214, line: 397, baseType: !209, size: 16, offset: 80)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !215, file: !214, line: 398, baseType: !209, size: 16, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !215, file: !214, line: 399, baseType: !209, size: 16, offset: 112)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !214, line: 430, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 425, size: 64, elements: !228)
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !227, file: !214, line: 426, baseType: !209, size: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !227, file: !214, line: 427, baseType: !209, size: 16, offset: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !227, file: !214, line: 428, baseType: !209, size: 16, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !227, file: !214, line: 429, baseType: !209, size: 16, offset: 48)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !214, line: 423, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 402, size: 304, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !235, file: !214, line: 403, baseType: !209, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !235, file: !214, line: 404, baseType: !209, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !235, file: !214, line: 405, baseType: !209, size: 16, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !235, file: !214, line: 406, baseType: !209, size: 16, offset: 48)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !235, file: !214, line: 407, baseType: !209, size: 16, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !235, file: !214, line: 408, baseType: !209, size: 16, offset: 80)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !235, file: !214, line: 409, baseType: !209, size: 16, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !235, file: !214, line: 410, baseType: !209, size: 16, offset: 112)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !235, file: !214, line: 411, baseType: !209, size: 16, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !235, file: !214, line: 412, baseType: !209, size: 16, offset: 144)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !235, file: !214, line: 413, baseType: !209, size: 16, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !235, file: !214, line: 414, baseType: !209, size: 16, offset: 176)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !235, file: !214, line: 415, baseType: !209, size: 16, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !235, file: !214, line: 416, baseType: !209, size: 16, offset: 208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !235, file: !214, line: 418, baseType: !209, size: 16, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !235, file: !214, line: 419, baseType: !209, size: 16, offset: 240)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !235, file: !214, line: 420, baseType: !209, size: 16, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !235, file: !214, line: 421, baseType: !209, size: 16, offset: 272)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !235, file: !214, line: 422, baseType: !209, size: 16, offset: 288)
!256 = !{!257, !441, !177, !443, !446, !448}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "__global_locale", scope: !179, file: !214, line: 377, type: !259, isLocal: false, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !183, line: 330, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !183, line: 154, size: 26560, elements: !262)
!262 = !{!263, !270, !276, !277, !281, !283, !284, !288, !292, !294, !295, !296, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !261, file: !183, line: 156, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !267, line: 38, baseType: !268)
!267 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/tmp/klee-uclibc-130")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !269, line: 44, baseType: !94)
!269 = !DIFile(filename: "./include/bits/types.h", directory: "/tmp/klee-uclibc-130")
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !261, file: !183, line: 157, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !267, line: 42, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !269, line: 43, baseType: !275)
!275 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !261, file: !183, line: 158, baseType: !271, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !261, file: !183, line: 162, baseType: !278, size: 6144, offset: 192)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 6144, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !261, file: !183, line: 163, baseType: !282, size: 6144, offset: 6336)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 6144, elements: !279)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !261, file: !183, line: 164, baseType: !282, size: 6144, offset: 12480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !261, file: !183, line: 168, baseType: !285, size: 112, offset: 18624)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 14)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !261, file: !183, line: 174, baseType: !289, size: 96, offset: 18736)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 6)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !261, file: !183, line: 175, baseType: !293, size: 48, offset: 18832)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !290)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !261, file: !183, line: 178, baseType: !96, size: 8, offset: 18880)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !261, file: !183, line: 179, baseType: !96, size: 8, offset: 18888)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !261, file: !183, line: 180, baseType: !297, size: 80, offset: 18896)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 80, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 10)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !261, file: !183, line: 183, baseType: !205, size: 64, offset: 19008)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !261, file: !183, line: 184, baseType: !205, size: 64, offset: 19072)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !261, file: !183, line: 185, baseType: !205, size: 64, offset: 19136)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !261, file: !183, line: 186, baseType: !205, size: 64, offset: 19200)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !261, file: !183, line: 188, baseType: !205, size: 64, offset: 19264)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !261, file: !183, line: 189, baseType: !207, size: 64, offset: 19328)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !261, file: !183, line: 190, baseType: !205, size: 64, offset: 19392)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !261, file: !183, line: 191, baseType: !205, size: 64, offset: 19456)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !261, file: !183, line: 197, baseType: !207, size: 64, offset: 19520)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !261, file: !183, line: 199, baseType: !205, size: 64, offset: 19584)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !261, file: !183, line: 200, baseType: !205, size: 64, offset: 19648)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !261, file: !183, line: 202, baseType: !312, size: 64, offset: 19712)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !275)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !261, file: !183, line: 205, baseType: !316, size: 32, offset: 19776)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !261, file: !183, line: 206, baseType: !316, size: 32, offset: 19808)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !261, file: !183, line: 207, baseType: !45, size: 32, offset: 19840)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !261, file: !183, line: 208, baseType: !45, size: 32, offset: 19872)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !261, file: !183, line: 213, baseType: !29, size: 64, offset: 19904)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !261, file: !183, line: 214, baseType: !29, size: 64, offset: 19968)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !261, file: !183, line: 215, baseType: !29, size: 64, offset: 20032)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !261, file: !183, line: 216, baseType: !29, size: 64, offset: 20096)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !261, file: !183, line: 217, baseType: !29, size: 64, offset: 20160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !261, file: !183, line: 218, baseType: !29, size: 64, offset: 20224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !261, file: !183, line: 219, baseType: !29, size: 64, offset: 20288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !261, file: !183, line: 220, baseType: !29, size: 64, offset: 20352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !261, file: !183, line: 221, baseType: !29, size: 64, offset: 20416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !261, file: !183, line: 222, baseType: !29, size: 64, offset: 20480)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !261, file: !183, line: 223, baseType: !29, size: 64, offset: 20544)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !261, file: !183, line: 226, baseType: !29, size: 64, offset: 20608)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !261, file: !183, line: 227, baseType: !29, size: 64, offset: 20672)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !261, file: !183, line: 228, baseType: !29, size: 64, offset: 20736)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !261, file: !183, line: 231, baseType: !29, size: 64, offset: 20800)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !261, file: !183, line: 232, baseType: !29, size: 64, offset: 20864)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !261, file: !183, line: 233, baseType: !29, size: 64, offset: 20928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !261, file: !183, line: 234, baseType: !29, size: 64, offset: 20992)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !261, file: !183, line: 235, baseType: !29, size: 64, offset: 21056)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !261, file: !183, line: 236, baseType: !29, size: 64, offset: 21120)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !261, file: !183, line: 237, baseType: !29, size: 64, offset: 21184)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !261, file: !183, line: 238, baseType: !29, size: 64, offset: 21248)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !261, file: !183, line: 239, baseType: !29, size: 64, offset: 21312)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !261, file: !183, line: 240, baseType: !29, size: 64, offset: 21376)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !261, file: !183, line: 241, baseType: !29, size: 64, offset: 21440)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !261, file: !183, line: 242, baseType: !29, size: 64, offset: 21504)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !261, file: !183, line: 243, baseType: !29, size: 64, offset: 21568)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !261, file: !183, line: 244, baseType: !29, size: 64, offset: 21632)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !261, file: !183, line: 245, baseType: !29, size: 64, offset: 21696)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !261, file: !183, line: 246, baseType: !29, size: 64, offset: 21760)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !261, file: !183, line: 247, baseType: !29, size: 64, offset: 21824)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !261, file: !183, line: 248, baseType: !29, size: 64, offset: 21888)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !261, file: !183, line: 249, baseType: !29, size: 64, offset: 21952)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !261, file: !183, line: 250, baseType: !29, size: 64, offset: 22016)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !261, file: !183, line: 251, baseType: !29, size: 64, offset: 22080)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !261, file: !183, line: 253, baseType: !29, size: 64, offset: 22144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !261, file: !183, line: 256, baseType: !29, size: 64, offset: 22208)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !261, file: !183, line: 257, baseType: !29, size: 64, offset: 22272)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !261, file: !183, line: 258, baseType: !29, size: 64, offset: 22336)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !261, file: !183, line: 259, baseType: !29, size: 64, offset: 22400)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !261, file: !183, line: 260, baseType: !29, size: 64, offset: 22464)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !261, file: !183, line: 261, baseType: !29, size: 64, offset: 22528)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !261, file: !183, line: 262, baseType: !29, size: 64, offset: 22592)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !261, file: !183, line: 264, baseType: !29, size: 64, offset: 22656)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !261, file: !183, line: 265, baseType: !29, size: 64, offset: 22720)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !261, file: !183, line: 266, baseType: !29, size: 64, offset: 22784)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !261, file: !183, line: 267, baseType: !29, size: 64, offset: 22848)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !261, file: !183, line: 268, baseType: !29, size: 64, offset: 22912)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !261, file: !183, line: 269, baseType: !29, size: 64, offset: 22976)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !261, file: !183, line: 270, baseType: !29, size: 64, offset: 23040)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !261, file: !183, line: 272, baseType: !29, size: 64, offset: 23104)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !261, file: !183, line: 273, baseType: !29, size: 64, offset: 23168)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !261, file: !183, line: 274, baseType: !29, size: 64, offset: 23232)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !261, file: !183, line: 275, baseType: !29, size: 64, offset: 23296)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !261, file: !183, line: 276, baseType: !29, size: 64, offset: 23360)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !261, file: !183, line: 277, baseType: !29, size: 64, offset: 23424)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !261, file: !183, line: 278, baseType: !29, size: 64, offset: 23488)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !261, file: !183, line: 279, baseType: !29, size: 64, offset: 23552)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !261, file: !183, line: 280, baseType: !29, size: 64, offset: 23616)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !261, file: !183, line: 281, baseType: !29, size: 64, offset: 23680)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !261, file: !183, line: 282, baseType: !29, size: 64, offset: 23744)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !261, file: !183, line: 283, baseType: !29, size: 64, offset: 23808)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !261, file: !183, line: 285, baseType: !29, size: 64, offset: 23872)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !261, file: !183, line: 286, baseType: !29, size: 64, offset: 23936)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !261, file: !183, line: 287, baseType: !29, size: 64, offset: 24000)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !261, file: !183, line: 288, baseType: !29, size: 64, offset: 24064)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !261, file: !183, line: 289, baseType: !29, size: 64, offset: 24128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !261, file: !183, line: 290, baseType: !29, size: 64, offset: 24192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !261, file: !183, line: 291, baseType: !29, size: 64, offset: 24256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !261, file: !183, line: 292, baseType: !29, size: 64, offset: 24320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !261, file: !183, line: 293, baseType: !29, size: 64, offset: 24384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !261, file: !183, line: 294, baseType: !29, size: 64, offset: 24448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !261, file: !183, line: 295, baseType: !29, size: 64, offset: 24512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !261, file: !183, line: 296, baseType: !29, size: 64, offset: 24576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !261, file: !183, line: 298, baseType: !29, size: 64, offset: 24640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !261, file: !183, line: 299, baseType: !29, size: 64, offset: 24704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !261, file: !183, line: 301, baseType: !29, size: 64, offset: 24768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !261, file: !183, line: 302, baseType: !29, size: 64, offset: 24832)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !261, file: !183, line: 303, baseType: !29, size: 64, offset: 24896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !261, file: !183, line: 304, baseType: !29, size: 64, offset: 24960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !261, file: !183, line: 305, baseType: !29, size: 64, offset: 25024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !261, file: !183, line: 307, baseType: !29, size: 64, offset: 25088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !261, file: !183, line: 308, baseType: !29, size: 64, offset: 25152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !261, file: !183, line: 309, baseType: !29, size: 64, offset: 25216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !261, file: !183, line: 310, baseType: !29, size: 64, offset: 25280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !261, file: !183, line: 311, baseType: !29, size: 64, offset: 25344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !261, file: !183, line: 316, baseType: !29, size: 64, offset: 25408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !261, file: !183, line: 317, baseType: !29, size: 64, offset: 25472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !261, file: !183, line: 318, baseType: !29, size: 64, offset: 25536)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !261, file: !183, line: 319, baseType: !29, size: 64, offset: 25600)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !261, file: !183, line: 322, baseType: !411, size: 896, offset: 25664)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !183, line: 149, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 111, size: 896, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !439, !440}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !412, file: !183, line: 112, baseType: !209, size: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !412, file: !183, line: 113, baseType: !209, size: 16, offset: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !412, file: !183, line: 114, baseType: !209, size: 16, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !412, file: !183, line: 115, baseType: !209, size: 16, offset: 48)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !412, file: !183, line: 116, baseType: !209, size: 16, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !412, file: !183, line: 117, baseType: !209, size: 16, offset: 80)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !412, file: !183, line: 118, baseType: !209, size: 16, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !412, file: !183, line: 119, baseType: !209, size: 16, offset: 112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !412, file: !183, line: 120, baseType: !209, size: 16, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !412, file: !183, line: 121, baseType: !209, size: 16, offset: 144)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !412, file: !183, line: 122, baseType: !209, size: 16, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !412, file: !183, line: 123, baseType: !209, size: 16, offset: 176)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !412, file: !183, line: 124, baseType: !209, size: 16, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !412, file: !183, line: 125, baseType: !209, size: 16, offset: 208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !412, file: !183, line: 127, baseType: !209, size: 16, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !412, file: !183, line: 128, baseType: !209, size: 16, offset: 240)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !412, file: !183, line: 130, baseType: !207, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !412, file: !183, line: 131, baseType: !207, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !412, file: !183, line: 132, baseType: !207, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !412, file: !183, line: 135, baseType: !207, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !412, file: !183, line: 138, baseType: !207, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !412, file: !183, line: 141, baseType: !207, size: 64, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !412, file: !183, line: 142, baseType: !207, size: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !412, file: !183, line: 145, baseType: !438, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !412, file: !183, line: 146, baseType: !438, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !412, file: !183, line: 148, baseType: !209, size: 16, offset: 832)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !179, file: !214, line: 380, type: !259, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "utf8", scope: !179, file: !214, line: 387, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !290)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "ascii", scope: !179, file: !214, line: 388, type: !445, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "__code2flag", scope: !179, file: !214, line: 854, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 256, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 16)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !183, line: 324, baseType: !261)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !456, file: !457, line: 131, type: !501, isLocal: true, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/tmp/klee-uclibc-130")
!458 = !{!459, !491, !493, !495, !497, !499, !454}
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "stdin", scope: !456, file: !457, line: 154, type: !461, isLocal: false, isDefinition: true)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !463, line: 46, baseType: !464)
!463 = !DIFile(filename: "./include/stdio.h", directory: "/tmp/klee-uclibc-130")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !465, line: 233, size: 704, elements: !466)
!465 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/tmp/klee-uclibc-130")
!466 = !{!467, !468, !472, !473, !474, !475, !476, !477, !478, !479, !481, !483, !490}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !464, file: !465, line: 234, baseType: !94, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !464, file: !465, line: 237, baseType: !469, size: 16, offset: 16)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 2)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !464, file: !465, line: 244, baseType: !45, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !464, file: !465, line: 246, baseType: !211, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !464, file: !465, line: 247, baseType: !211, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !464, file: !465, line: 248, baseType: !211, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !464, file: !465, line: 249, baseType: !211, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !464, file: !465, line: 252, baseType: !211, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !464, file: !465, line: 255, baseType: !211, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !464, file: !465, line: 261, baseType: !480, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !464, file: !465, line: 268, baseType: !482, size: 64, offset: 512)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 64, elements: !470)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !464, file: !465, line: 271, baseType: !484, size: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !485, line: 85, baseType: !486)
!485 = !DIFile(filename: "./include/wchar.h", directory: "/tmp/klee-uclibc-130")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 81, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !486, file: !485, line: 83, baseType: !316, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !486, file: !485, line: 84, baseType: !316, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !464, file: !465, line: 274, baseType: !6, size: 64, offset: 640)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stdout", scope: !456, file: !457, line: 155, type: !461, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "stderr", scope: !456, file: !457, line: 156, type: !461, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdin", scope: !456, file: !457, line: 159, type: !461, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "__stdout", scope: !456, file: !457, line: 162, type: !461, isLocal: false, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !456, file: !457, line: 180, type: !461, isLocal: false, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 2112, elements: !137)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "argv", scope: !504, file: !508, line: 74, type: !37, isLocal: true, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !506, retainedTypes: !515, globals: !516, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "../src/lbracket.c", directory: "/coreutils/obj-llvm")
!506 = !{!507, !513}
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !508, line: 60, baseType: !62, size: 32, elements: !509)
!508 = !DIFile(filename: "../src/test.c", directory: "/coreutils/obj-llvm")
!509 = !{!510, !511, !512}
!510 = !DIEnumerator(name: "TEST_TRUE", value: 0)
!511 = !DIEnumerator(name: "TEST_FALSE", value: 1)
!512 = !DIEnumerator(name: "TEST_FAILURE", value: 2)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !514, line: 46, baseType: !62, size: 32, elements: !190)
!514 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!515 = !{!29, !7, !6, !45, !94, !62}
!516 = !{!517, !519, !502}
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "pos", scope: !504, file: !508, line: 72, type: !45, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "argc", scope: !504, file: !508, line: 73, type: !45, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "program_name", scope: !523, file: !524, line: 33, type: !29, isLocal: false, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !525, globals: !526, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "../lib/progname.c", directory: "/coreutils/obj-llvm")
!525 = !{!6, !7}
!526 = !{!521}
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "slotvec", scope: !529, file: !530, line: 840, type: !587, isLocal: true, isDefinition: true)
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !531, retainedTypes: !551, globals: !552, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "../lib/quotearg.c", directory: "/coreutils/obj-llvm")
!531 = !{!532, !546, !513}
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !533, line: 37, baseType: !62, size: 32, elements: !534)
!533 = !DIFile(filename: "../lib/quotearg.h", directory: "/coreutils/obj-llvm")
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!535 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!536 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!537 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!538 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!539 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!540 = !DIEnumerator(name: "c_quoting_style", value: 5)
!541 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!542 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!543 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!544 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!545 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!546 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !533, line: 247, baseType: !62, size: 32, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!549 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!550 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!551 = !{!45, !94, !23, !29}
!552 = !{!553, !559, !563, !575, !577, !527, !579, !581}
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !529, file: !530, line: 77, type: !555, isLocal: false, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 704, elements: !557)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!557 = !{!558}
!558 = !DISubrange(count: 11)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !529, file: !530, line: 93, type: !561, isLocal: false, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 320, elements: !298)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !529, file: !530, line: 1047, type: !565, isLocal: false, isDefinition: true)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !530, line: 57, size: 448, elements: !566)
!566 = !{!567, !568, !569, !573, !574}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !565, file: !530, line: 60, baseType: !532, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !565, file: !530, line: 63, baseType: !45, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !565, file: !530, line: 67, baseType: !570, size: 256, offset: 64)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 8)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !565, file: !530, line: 70, baseType: !29, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !565, file: !530, line: 73, baseType: !29, size: 64, offset: 384)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !529, file: !530, line: 108, type: !565, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "slot0", scope: !529, file: !530, line: 837, type: !98, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "nslots", scope: !529, file: !530, line: 838, type: !45, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "slotvec0", scope: !529, file: !530, line: 839, type: !583, isLocal: true, isDefinition: true)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !530, line: 829, size: 128, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !583, file: !530, line: 831, baseType: !23, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !583, file: !530, line: 832, baseType: !7, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !590, file: !591, line: 26, type: !593, isLocal: false, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !592, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/coreutils/obj-llvm")
!592 = !{!588}
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 47)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "exit_failure", scope: !598, file: !599, line: 24, type: !601, isLocal: false, isDefinition: true)
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !600, splitDebugInlining: false, nameTableKind: None)
!599 = !DIFile(filename: "../lib/exitfail.c", directory: "/coreutils/obj-llvm")
!600 = !{!596}
!601 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "empty", scope: !604, file: !214, line: 1063, type: !608, isLocal: true, isDefinition: true)
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !606, globals: !607, splitDebugInlining: false, nameTableKind: None)
!605 = !DIFile(filename: "libc/misc/locale/nl_langinfo_l.c", directory: "/tmp/klee-uclibc-130")
!606 = !{!45, !37, !7}
!607 = !{!602}
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 1)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "internal_state", scope: !613, file: !614, line: 93, type: !617, isLocal: true, isDefinition: true)
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !615, globals: !616, splitDebugInlining: false, nameTableKind: None)
!614 = !DIFile(filename: "../lib/mbrtoc32.c", directory: "/coreutils/obj-llvm")
!615 = !{!6, !23, !96}
!616 = !{!611}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !618, line: 6, baseType: !619)
!618 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !620, line: 21, baseType: !621)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 13, size: 64, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !621, file: !620, line: 15, baseType: !45, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !621, file: !620, line: 20, baseType: !625, size: 32, offset: 32)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !620, line: 16, size: 32, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !625, file: !620, line: 18, baseType: !62, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !625, file: !620, line: 19, baseType: !629, size: 32)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 4)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "posix", scope: !634, file: !214, line: 1093, type: !445, isLocal: true, isDefinition: true)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !636, globals: !637, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "libc/misc/locale/newlocale.c", directory: "/tmp/klee-uclibc-130")
!636 = !{!62, !7, !6, !23, !211, !45}
!637 = !{!638, !632, !796}
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "envstr", scope: !640, file: !214, line: 1269, type: !795, isLocal: true, isDefinition: true)
!640 = distinct !DISubprogram(name: "newlocale", scope: !214, file: !214, line: 1243, type: !641, scopeLine: 1244, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !634, retainedNodes: !4)
!641 = !DISubroutineType(types: !642)
!642 = !{!643, !45, !29, !643}
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !183, line: 330, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !183, line: 154, size: 26560, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !645, file: !183, line: 156, baseType: !264, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !645, file: !183, line: 157, baseType: !271, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !645, file: !183, line: 158, baseType: !271, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !645, file: !183, line: 162, baseType: !278, size: 6144, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !645, file: !183, line: 163, baseType: !282, size: 6144, offset: 6336)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !645, file: !183, line: 164, baseType: !282, size: 6144, offset: 12480)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !645, file: !183, line: 168, baseType: !285, size: 112, offset: 18624)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !645, file: !183, line: 174, baseType: !289, size: 96, offset: 18736)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !645, file: !183, line: 175, baseType: !293, size: 48, offset: 18832)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !645, file: !183, line: 178, baseType: !96, size: 8, offset: 18880)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !645, file: !183, line: 179, baseType: !96, size: 8, offset: 18888)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !645, file: !183, line: 180, baseType: !297, size: 80, offset: 18896)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !645, file: !183, line: 183, baseType: !205, size: 64, offset: 19008)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !645, file: !183, line: 184, baseType: !205, size: 64, offset: 19072)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !645, file: !183, line: 185, baseType: !205, size: 64, offset: 19136)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !645, file: !183, line: 186, baseType: !205, size: 64, offset: 19200)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !645, file: !183, line: 188, baseType: !205, size: 64, offset: 19264)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !645, file: !183, line: 189, baseType: !207, size: 64, offset: 19328)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !645, file: !183, line: 190, baseType: !205, size: 64, offset: 19392)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !645, file: !183, line: 191, baseType: !205, size: 64, offset: 19456)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !645, file: !183, line: 197, baseType: !207, size: 64, offset: 19520)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !645, file: !183, line: 199, baseType: !205, size: 64, offset: 19584)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !645, file: !183, line: 200, baseType: !205, size: 64, offset: 19648)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !645, file: !183, line: 202, baseType: !312, size: 64, offset: 19712)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !645, file: !183, line: 205, baseType: !316, size: 32, offset: 19776)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !645, file: !183, line: 206, baseType: !316, size: 32, offset: 19808)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !645, file: !183, line: 207, baseType: !45, size: 32, offset: 19840)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !645, file: !183, line: 208, baseType: !45, size: 32, offset: 19872)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !645, file: !183, line: 213, baseType: !29, size: 64, offset: 19904)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !645, file: !183, line: 214, baseType: !29, size: 64, offset: 19968)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !645, file: !183, line: 215, baseType: !29, size: 64, offset: 20032)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !645, file: !183, line: 216, baseType: !29, size: 64, offset: 20096)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !645, file: !183, line: 217, baseType: !29, size: 64, offset: 20160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !645, file: !183, line: 218, baseType: !29, size: 64, offset: 20224)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !645, file: !183, line: 219, baseType: !29, size: 64, offset: 20288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !645, file: !183, line: 220, baseType: !29, size: 64, offset: 20352)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !645, file: !183, line: 221, baseType: !29, size: 64, offset: 20416)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !645, file: !183, line: 222, baseType: !29, size: 64, offset: 20480)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !645, file: !183, line: 223, baseType: !29, size: 64, offset: 20544)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !645, file: !183, line: 226, baseType: !29, size: 64, offset: 20608)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !645, file: !183, line: 227, baseType: !29, size: 64, offset: 20672)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !645, file: !183, line: 228, baseType: !29, size: 64, offset: 20736)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !645, file: !183, line: 231, baseType: !29, size: 64, offset: 20800)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !645, file: !183, line: 232, baseType: !29, size: 64, offset: 20864)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !645, file: !183, line: 233, baseType: !29, size: 64, offset: 20928)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !645, file: !183, line: 234, baseType: !29, size: 64, offset: 20992)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !645, file: !183, line: 235, baseType: !29, size: 64, offset: 21056)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !645, file: !183, line: 236, baseType: !29, size: 64, offset: 21120)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !645, file: !183, line: 237, baseType: !29, size: 64, offset: 21184)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !645, file: !183, line: 238, baseType: !29, size: 64, offset: 21248)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !645, file: !183, line: 239, baseType: !29, size: 64, offset: 21312)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !645, file: !183, line: 240, baseType: !29, size: 64, offset: 21376)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !645, file: !183, line: 241, baseType: !29, size: 64, offset: 21440)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !645, file: !183, line: 242, baseType: !29, size: 64, offset: 21504)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !645, file: !183, line: 243, baseType: !29, size: 64, offset: 21568)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !645, file: !183, line: 244, baseType: !29, size: 64, offset: 21632)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !645, file: !183, line: 245, baseType: !29, size: 64, offset: 21696)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !645, file: !183, line: 246, baseType: !29, size: 64, offset: 21760)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !645, file: !183, line: 247, baseType: !29, size: 64, offset: 21824)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !645, file: !183, line: 248, baseType: !29, size: 64, offset: 21888)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !645, file: !183, line: 249, baseType: !29, size: 64, offset: 21952)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !645, file: !183, line: 250, baseType: !29, size: 64, offset: 22016)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !645, file: !183, line: 251, baseType: !29, size: 64, offset: 22080)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !645, file: !183, line: 253, baseType: !29, size: 64, offset: 22144)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !645, file: !183, line: 256, baseType: !29, size: 64, offset: 22208)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !645, file: !183, line: 257, baseType: !29, size: 64, offset: 22272)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !645, file: !183, line: 258, baseType: !29, size: 64, offset: 22336)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !645, file: !183, line: 259, baseType: !29, size: 64, offset: 22400)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !645, file: !183, line: 260, baseType: !29, size: 64, offset: 22464)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !645, file: !183, line: 261, baseType: !29, size: 64, offset: 22528)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !645, file: !183, line: 262, baseType: !29, size: 64, offset: 22592)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !645, file: !183, line: 264, baseType: !29, size: 64, offset: 22656)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !645, file: !183, line: 265, baseType: !29, size: 64, offset: 22720)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !645, file: !183, line: 266, baseType: !29, size: 64, offset: 22784)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !645, file: !183, line: 267, baseType: !29, size: 64, offset: 22848)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !645, file: !183, line: 268, baseType: !29, size: 64, offset: 22912)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !645, file: !183, line: 269, baseType: !29, size: 64, offset: 22976)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !645, file: !183, line: 270, baseType: !29, size: 64, offset: 23040)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !645, file: !183, line: 272, baseType: !29, size: 64, offset: 23104)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !645, file: !183, line: 273, baseType: !29, size: 64, offset: 23168)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !645, file: !183, line: 274, baseType: !29, size: 64, offset: 23232)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !645, file: !183, line: 275, baseType: !29, size: 64, offset: 23296)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !645, file: !183, line: 276, baseType: !29, size: 64, offset: 23360)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !645, file: !183, line: 277, baseType: !29, size: 64, offset: 23424)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !645, file: !183, line: 278, baseType: !29, size: 64, offset: 23488)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !645, file: !183, line: 279, baseType: !29, size: 64, offset: 23552)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !645, file: !183, line: 280, baseType: !29, size: 64, offset: 23616)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !645, file: !183, line: 281, baseType: !29, size: 64, offset: 23680)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !645, file: !183, line: 282, baseType: !29, size: 64, offset: 23744)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !645, file: !183, line: 283, baseType: !29, size: 64, offset: 23808)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !645, file: !183, line: 285, baseType: !29, size: 64, offset: 23872)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !645, file: !183, line: 286, baseType: !29, size: 64, offset: 23936)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !645, file: !183, line: 287, baseType: !29, size: 64, offset: 24000)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !645, file: !183, line: 288, baseType: !29, size: 64, offset: 24064)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !645, file: !183, line: 289, baseType: !29, size: 64, offset: 24128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !645, file: !183, line: 290, baseType: !29, size: 64, offset: 24192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !645, file: !183, line: 291, baseType: !29, size: 64, offset: 24256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !645, file: !183, line: 292, baseType: !29, size: 64, offset: 24320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !645, file: !183, line: 293, baseType: !29, size: 64, offset: 24384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !645, file: !183, line: 294, baseType: !29, size: 64, offset: 24448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !645, file: !183, line: 295, baseType: !29, size: 64, offset: 24512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !645, file: !183, line: 296, baseType: !29, size: 64, offset: 24576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !645, file: !183, line: 298, baseType: !29, size: 64, offset: 24640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !645, file: !183, line: 299, baseType: !29, size: 64, offset: 24704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !645, file: !183, line: 301, baseType: !29, size: 64, offset: 24768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !645, file: !183, line: 302, baseType: !29, size: 64, offset: 24832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !645, file: !183, line: 303, baseType: !29, size: 64, offset: 24896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !645, file: !183, line: 304, baseType: !29, size: 64, offset: 24960)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !645, file: !183, line: 305, baseType: !29, size: 64, offset: 25024)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !645, file: !183, line: 307, baseType: !29, size: 64, offset: 25088)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !645, file: !183, line: 308, baseType: !29, size: 64, offset: 25152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !645, file: !183, line: 309, baseType: !29, size: 64, offset: 25216)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !645, file: !183, line: 310, baseType: !29, size: 64, offset: 25280)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !645, file: !183, line: 311, baseType: !29, size: 64, offset: 25344)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !645, file: !183, line: 316, baseType: !29, size: 64, offset: 25408)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !645, file: !183, line: 317, baseType: !29, size: 64, offset: 25472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !645, file: !183, line: 318, baseType: !29, size: 64, offset: 25536)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !645, file: !183, line: 319, baseType: !29, size: 64, offset: 25600)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !645, file: !183, line: 322, baseType: !766, size: 896, offset: 25664)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !183, line: 149, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 111, size: 896, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !767, file: !183, line: 112, baseType: !209, size: 16)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !767, file: !183, line: 113, baseType: !209, size: 16, offset: 16)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !767, file: !183, line: 114, baseType: !209, size: 16, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !767, file: !183, line: 115, baseType: !209, size: 16, offset: 48)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !767, file: !183, line: 116, baseType: !209, size: 16, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !767, file: !183, line: 117, baseType: !209, size: 16, offset: 80)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !767, file: !183, line: 118, baseType: !209, size: 16, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !767, file: !183, line: 119, baseType: !209, size: 16, offset: 112)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !767, file: !183, line: 120, baseType: !209, size: 16, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !767, file: !183, line: 121, baseType: !209, size: 16, offset: 144)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !767, file: !183, line: 122, baseType: !209, size: 16, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !767, file: !183, line: 123, baseType: !209, size: 16, offset: 176)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !767, file: !183, line: 124, baseType: !209, size: 16, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !767, file: !183, line: 125, baseType: !209, size: 16, offset: 208)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !767, file: !183, line: 127, baseType: !209, size: 16, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !767, file: !183, line: 128, baseType: !209, size: 16, offset: 240)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !767, file: !183, line: 130, baseType: !207, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !767, file: !183, line: 131, baseType: !207, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !767, file: !183, line: 132, baseType: !207, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !767, file: !183, line: 135, baseType: !207, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !767, file: !183, line: 138, baseType: !207, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !767, file: !183, line: 141, baseType: !207, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !767, file: !183, line: 142, baseType: !207, size: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !767, file: !183, line: 145, baseType: !438, size: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !767, file: !183, line: 146, baseType: !438, size: 64, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !767, file: !183, line: 148, baseType: !209, size: 16, offset: 832)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !630)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "utf8", scope: !634, file: !214, line: 1094, type: !445, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !800, file: !801, line: 209, type: !984, isLocal: true, isDefinition: true)
!800 = distinct !DISubprogram(name: "printf_fetchargs", scope: !801, file: !801, line: 39, type: !802, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !975, retainedNodes: !979)
!801 = !DIFile(filename: "../lib/printf-args.c", directory: "/coreutils/obj-llvm")
!802 = !DISubroutineType(types: !803)
!803 = !{!45, !804, !811}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !806)
!806 = !{!807, !808, !809, !810}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !805, file: !801, baseType: !62, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !805, file: !801, baseType: !62, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !805, file: !801, baseType: !6, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !805, file: !801, baseType: !6, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !813, line: 194, baseType: !814)
!813 = !DIFile(filename: "../lib/printf-args.h", directory: "/coreutils/obj-llvm")
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !813, line: 188, size: 1920, elements: !815)
!815 = !{!816, !817, !971}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !814, file: !813, line: 190, baseType: !23, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !814, file: !813, line: 191, baseType: !818, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !813, line: 183, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !813, line: 118, size: 256, elements: !821)
!821 = !{!822, !873}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !820, file: !813, line: 120, baseType: !823, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !813, line: 115, baseType: !824)
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !813, line: 52, baseType: !62, size: 32, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872}
!826 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!827 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!828 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!829 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!830 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!831 = !DIEnumerator(name: "TYPE_INT", value: 5)
!832 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!833 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!834 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!835 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!836 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!837 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!838 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!839 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!840 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!841 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!842 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!843 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!844 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!845 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!846 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!847 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!848 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!849 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!850 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!851 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!852 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!853 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!854 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!855 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!856 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!857 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!858 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!859 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!860 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!861 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!862 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!863 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!864 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!865 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!866 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!867 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!868 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!869 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!870 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!871 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!872 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !820, file: !813, line: 181, baseType: !874, size: 128, offset: 128)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !820, file: !813, line: 121, size: 128, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884, !886, !887, !891, !895, !898, !901, !904, !907, !910, !913, !916, !918, !920, !922, !924, !926, !928, !930, !932, !934, !936, !937, !940, !941, !944, !945, !947, !949, !951, !953, !955, !957, !959, !961, !963, !965, !967, !969}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !874, file: !813, line: 123, baseType: !210, size: 8)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !874, file: !813, line: 124, baseType: !96, size: 8)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !874, file: !813, line: 125, baseType: !275, size: 16)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !874, file: !813, line: 126, baseType: !94, size: 16)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !874, file: !813, line: 127, baseType: !45, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !874, file: !813, line: 128, baseType: !62, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !874, file: !813, line: 129, baseType: !81, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !874, file: !813, line: 130, baseType: !10, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !874, file: !813, line: 131, baseType: !885, size: 64)
!885 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !874, file: !813, line: 132, baseType: !25, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !874, file: !813, line: 133, baseType: !888, size: 8)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !889, line: 24, baseType: !890)
!889 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !85, line: 37, baseType: !210)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !874, file: !813, line: 134, baseType: !892, size: 8)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !893, line: 24, baseType: !894)
!893 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !85, line: 38, baseType: !96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !874, file: !813, line: 135, baseType: !896, size: 16)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !889, line: 25, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !85, line: 39, baseType: !275)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !874, file: !813, line: 136, baseType: !899, size: 16)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !893, line: 25, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !85, line: 40, baseType: !94)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !874, file: !813, line: 137, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !889, line: 26, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !85, line: 41, baseType: !45)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !874, file: !813, line: 138, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !893, line: 26, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !85, line: 42, baseType: !62)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !874, file: !813, line: 139, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !889, line: 27, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !85, line: 44, baseType: !81)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !874, file: !813, line: 140, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !893, line: 27, baseType: !912)
